[{"Website:": "Monster PH", "Job Title": "APAC Logistics & Trade Compliance Manager - Alabang, Muntinlupa", "Category": "  Industry:     Chemicals / Petrochemicals    ", "Company": "Cobden & Carter International", "Date Posted": "Posted On: 14 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            15-25 years                                        ", "Job Description": "  Job Description   Required ExperienceBachelor’s Degree in any business-related courseCPIM or CSCP Certified10 years industry experience in handling logistics operations in Chemical Industry5 years project management experience with supply chain projects, LEAN or Six Sigma trainedKnowledgeable in Trade Compliance for APAC, able to act as subject matter expert Can understand and speak MandarinPreferred CompetenciesKnowledge in SAP ERP, SAP Business Warehouse, Microsoft Office, Adobe acrobatLEAN or Six-sigma methodologies trainedDetail oriented, ability to consistently meet tight deadlines and able to manage multiple tasksAbility to thrive in a fast-paced business environmentStrong analytical ability and ability to see the big picture with detailed analysisStrong interpersonal and team building skills to manage relationships between all levels across business units as well as externally.Able to critically review and negotiate supply contracts and possess a strong understanding of standard contract terms and terminology.Good written and oral communication skills including both oral and written fluency in English.To lead and develop continuous improvement plans with minimum supervisionJob DescriptionResponsible for logistics and trade compliance in the region and manage performance management of all modes of transportation (road, rail, ocean & air), export/import operations and customs brokerage. Leverages multi-national partnerships with 3PL and 4PL service providers, customs brokers and freight forwarders. Ensuring that the importing and exporting activities of company across all product and business units, comply with laws, rules and regulations. Directs the collaboration between the logistics organization and cross-functional business leaders to develop and execute the company integrated business management strategy while identifying continuous improvement opportunities and supply chain excellence initiatives for APAC.Major ResponsibilitiesStrategyDevelops and executes the APAC Logistics & Trade Compliance strategy, delink from fire-fighting mode of operations.Responsible Lead in the management and implementation of core logistics strategies, plans and programs, including product tanks returns for Asia Pacific.To identify annual productivity savings and continuous improvement opportunities in Logistics related areas. Target to reduce by 10% per year.Works synergistically across all businesses/regions to develop international supply chain metrics, scorecards, OTIF and KPI targets.Optimizes annual transportation spend, working with APAC sites to support sales growth with minimal incremental costs.Participate and act as Subject Matter Expert to all FTA related processes and discussions for APAC, supporting the business decisions and growth.OperationsManage logistic service providers, freight forwarder, warehouse providers and related supplier relationships including development, safety audit, negotiation, performance metrics and management of contracts.Leads in contract negotiations with all logistics freight and third-party warehouse providers for the off\u0002site service providers and participate closely with site logistics negotiation together with sites.Manages the quarterly import duty drawback program.Responsible for all freight and logistics invoices verification and approval.Provide logistics market insight and knowledge to business unitsProvide primary support to company Asia Pacific personnel, serving as a primary point of contact for Foreign Trade and Compliance issues related to ensuring compliance with import and export regulations. This includes the import and export of products, services, transfer of technical data, and all other import/export licensing and compliance matters.Standardize company-wide Logistics processes for Asia Pacific. Develop, document, and revise as necessary import and export management procedures in accordance with related local regulations in Asia Pacific, company corporate policy, and industry best practices.Proactively monitor regulatory changes, identifying risks/benefits/impact to company, and develop procedure to ensure compliance.Direct routine company compliance audits - internal and external.Collaborate with company affiliate companies to streamline import and export operations while maintaining regulatory compliance.NetworkingCollaborates with the order fulfillment organization to drive the concept of total order fulfillment vs. a traditional customer service/call center culture (end-to-end global supply chain, customer experience and relationship management).Act as primary point of contact for Customer Service teams and all shipping locations for import and export assistance.Partners with service providers and key customers to establish/maintain strong relationships that build trust and achieve results.Continuous ImprovementLeads supply chain projects to address performance issues identified through the CAPA process.Manages the corrective and preventative action (CAPA) process to identify order fulfillment gaps.Design and set-up proper RFP processes for the sites in APAC to implement.   ", "Office Location": "                                           Metro Manila / NCR                                      "}, {"Website:": "Monster PH", "Job Title": "Front End Developer", "Category": "  Industry:     IT / Computers - Software ,   Chemicals / Petrochemicals    ", "Company": "Prov International (Philippines) Inc.", "Date Posted": "Posted On: 4 months ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Education:Bachelors/ Degree ", "Years of Work Expirience": "                                            5-10 years                                        ", "Job Description": "  Job Description   In this role you will: • Develop new features and functionality in line with the tasks allocated from the sprints, working closely with inhouse Designers and SMEs, and the 3rd Party Development team that are currently working on the deliveries• Undertake Level 2/3 management of the services deployed into production; including the maintenance & tuning of the existing code base• Responsible for the code reviews & managing the integrity of the production code base i.e. Auditing & managing the production code base / code repository• Management of the Front End – ensuring documentation and standards are maintained• Ensuring the correct details are written to the relevant log files for analysis and monitoring / alerting• Oversight of the Data integrity within the environments & for the releases• You will assist with the design and implementation of the continuous integration, automated testing and continuous deployment initiativeYou will need the following technical skills • Solid understanding of web development (5+ years)• Proficient in web frontend development: ReactJS (preferred), Angular, Javascript, NodeJS, Redux, JSON, HTML5, CSS• Experienced in database management: PostgreSQL, MongoDB• Worked with Test Tools such as Enzyme, Cypress, Selenium• Version Control: Git• Build, Packaging & Deployment Tools: Webpack, npm, Docker, Jenkins• Good Understanding of Cloud technologies Azure (essential) and AWS or Google• Experience with Integration Projects  ", "Office Location": "                                           Metro Manila / NCR                                      "}, {"Website:": "Monster PH", "Job Title": "ASEAN Digital Marketing Manager", "Category": "  Industry:     Chemicals / Petrochemicals    ", "Company": "BASF Construction Chemicals UAE LLC", "Date Posted": "Posted On: 26 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            5-8 years                                        ", "Job Description": "  Job Description   DescriptionDescription:In the Philippines, BASF has been enabling manufacturers in various industries since 1963. Today, BASF Philippines, Inc. is a leading supplier of chemicals for industries including construction and coatings, automotive, health and nutrition, personal and home care, chemicals and plastics, and agriculture. BASF also operates an agricultural research station which conducts research, laboratory studies and field testing of novel technologies as part of BASF's global research effort in the field of agricultural solutions. In 2018, BASF posted sales to customers in Philippines of approximately €113 million and employed 95 people as of the end of the year. Further information on BASF in the Philippines is available at www.basf.com/ph.Objective of the position:This position is responsible for expanding the business reach to channel partners and farms by managing and driving key digital marketing projects in ASEAN. This is done in close collaboration with country marketing teams by developing digital marketing strategies using digital marketing models, processes, frameworks and to measure the success of campaigns using digital analytics tools.Main Areas of Responsibilities:1. Support Country Marketing Managers by: Performing basic analysis to identify As-Is situation and urgent issues in digital marketing competence.Managing the process of gathering, analyzing, and understanding the right data, by turning them into actionable consumer insights for marketing strategies in the country. Working with the crop managers, supporting teams and vendors to launch products on time and on budget that includes digital promotion programs/ activities for Channel Partner (Wholesaler & Retailer) and End Users (Farmers & Plantation Managers).Leading integrated digital marketing campaigns from concept to execution. 2. Develop and Roll-out of a Digital Marketing Framework by: Identifying trends and insights and optimizing spend and performance based on the insights.Developing the long-term web strategy and coordinating short-term web implementation plans.Planning and executing all digital marketing including SEO/SEM, marketing database, email, social media.Evaluating end-to-end customer experience across multiple channels and customer touch points.Measuring and reporting performance of all digital marketing campaigns and assess against goals (ROI and KPIs).Minimum Education and Qualification Required: Bachelor's Degree in Advertising, Marketing, Communication Arts and other related courses with specialization in Digital Marketing.With at least 5 years experience in digital marketing with a proven successful track record of increasing revenue through innovative and effective marketing, leadership and skills including use of latest technology. Experience in agricultural industry is preferred but not mandatory.With keen understanding of prevailing market trends and challenges, and in-depth knowledge of the different frameworks, strategies and tools on digital marketing and communication.Possess excellent communication skills, fluent in both oral and written English.With strong analytical and problem-solving skills.Possess strong planning and project management skills.Possess high level of energy and able to maintain stable performance under pressure.With strong abilities in relationship building and collaborating with multi-discipline team members.Demonstrates leadership, professionalism, and integrity at work.With valid driver's license.  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Import/Export Logistics Senior Specialist", "Category": "  Industry:     Chemicals / Petrochemicals    ", "Company": "BASF Construction Chemicals UAE LLC", "Date Posted": "Posted On: 29 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            5-8 years                                        ", "Job Description": "  Job Description   DescriptionIn the Philippines, BASF has been supporting manufacturers from various industries since 1963. Today, BASF is a leading supplier of chemicals for industries, including construction and coatings, automotive, nutrition & health, home & personal care, and agriculture. BASF also operates an agricultural research station in the country which conducts research, laboratory studies and field testing of novel technologies. In 2020, BASF posted sales to customers in the Philippines of approximately €76 million and employed 84 people as of the end of the year. Further information is available on the internet at www.basf.com/ph.Objectives of the position: To manage import/export logistics services in support of the prescribed business models for all Business Units (BUs) of BASF Philippines; ensuring service efficiencies and continuous improvement programs to enhance the quality of the services provided and/or the efficiency of support processes.To work with Asia Pacific functional service owners (Import/Export, Transportation Management, Customs & Foreign Trade, Transportation and Distribution Safety) and ensure compliance to corporate and mandatory requirements; and take necessary actions to assure their initiatives are met. Main Areas of Responsibilities: Conduct an annual review of group, local statutory, and Customs requirements to ensure compliance.Review, support, and apply Free Trade Agreements to realize their benefits and cost avoidance.Ensure supply chain competitiveness by working with logistics procurement to benchmark costs and obtain the best value for required services, to be reported semi-annually or as needed.Monitor logistics functional costs or expenses with reference to the budget. Review and approve on a weekly basis, all logistics service provider invoices, and billings, to be reported semi-annually or as needed.Maintain material master when and where Import/export logistics is needed.Provide supply chain support, consultation and /or solutions on the governance of new business requiring logistics services, observing company policies and directives. Identify, recommend, and implement measures to improve import/export logistics process efficiency, effectiveness, and operational costs through the quarterly KPI reports, or as needed.Review and allocate resources and responsibilities among staff to deliver business results and develop team members. Run a daily performance metrics meeting with supply chain, customer service, and logistics service providers to ensure that the supply chain resource strategy is executable and flexible to respond to demand variations.Participate in annual preparation of the regional Supply Chain, Import/Export, and Customs and Foreign Trade, and Philippine management strategic plans, the directives of which will be worked into the annual Supply Chain Philippines strategic plan.Establish and maintain effective relationships with the local management team, business unit heads, regional stakeholders and global governance functions, and any other BASF communities.Support import/export logistics staffing requirements and HR retention strategies, succession plans and personnel development initiatives. Assist in hiring, training, supervision, motivation, and career development of staff.Establish development measures and appraise the overall performance of subordinates semi-annually following the prescribed personnel performance assessment schedule. Coach any direct reports as needed and develop succession planning for key positions as part of the annual performance review.Minimum Education and Qualification Required: Education: Logistics Management, Business Administration, Management Engineering, Economics, Industrial Engineering, or related courses.Work Experience: At least 5 years of work experience in Import/Export as well as customs and foreign trade functions including, but not limited to, management of external logistics service providers for import/export and transportation services in a multinational company; preferably from a semi-conductor and similar manufacturing companies.Knowledge of Supply Chain Operations, Quality Management Systems (ISO 9001:2000), Logistics ManagementProficient in SAP Order-to-Cash (Sales and Distribution, Materials Master, Transport Management) processes and system applications.Possess excellent project management skillsPossess strong analytical and problem-solving abilities.With very good relationship building, interpersonal communication, and personal presentation.Outstanding command of spoken and written communication skills.Proficient in MS Office/Windows.Demonstrate leadership, professionalism, and integrity at work.With strong sense of customer service.Proactive, can work independently and in teams.   ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Research Assistant, Field Biology Fungicide", "Category": "  Industry:     Chemicals / Petrochemicals    ", "Company": "BASF Construction Chemicals UAE LLC", "Date Posted": "Posted On: 29 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            1-2 years                                        ", "Job Description": "  Job Description   DescriptionIn the Philippines, BASF has been supporting manufacturers from various industries since 1963. Today, BASF is a leading supplier of chemicals for industries, including construction and coatings, automotive, nutrition & health, home & personal care, and agriculture. BASF also operates an agricultural research station in the country which conducts research, laboratory studies and field testing of novel technologies. In 2020, BASF posted sales to customers in the Philippines of approximately €76 million and employed 84 people as of the end of the year. Further information is available on the internet at www.basf.com/ph.Objective of the position: To assist the Fungicide Field Biologist in the smooth implementation of field, screen house, micro plot and small plot trials. Assist in improving the team's trial capabilities by discovering and optimizing new pathosystems.Main Areas of Responsibilities: Ensure that all field, screen-house, micro plot, and small plot trials are in accordance with BASF policies and procedures and that they are done under good agronomic practice for all trial crops.Make sure that all Experimental Use Permit (EUP) applications from Fertilizers and Pesticides Authority (FPA) are applied on time for proper implementation of the field trials.Ensure the availability of key crops seeds inventory for the station and off site trials.Support the Field Biologist for encoding the trial data results and report on a timely manner and ensure that the Research Station Manager is properly informed of the status of approved fungicide trials and make sure that the monthly reports are submitted on time.Develop innovative techniques to efficiently conduct assigned trials such as the further development of the plant pathology laboratory by introducing new fungal/bacterial isolates that can be used for field trials.Assist the Field Biologist in developing the research station manual. The said manual encompasses standard operating procedures from Field Biology (Fungicide, Herbicide and Insecticide) and Insecticide Research.Assist the Field Biologist in handling a program intended to have a thorough and correct inventory of all compounds/chemicals (i.e., experimental compounds, standards etc) being used by the Farm Operations, Fungicide, Herbicide, and Insecticide groups.Coordinate with the Field Technician and Field Aids assigned to the team.Maintain good housekeeping of the station as well as all off-site trials by ensuring cleanliness and orderliness in the workplace and proper implementation of BASF safety, health and environment policies and procedures.Minimum Qualifications: Bachellor of Science in Agriculture graduate preferably major in Plant Pathology; passed the board examination for professional Agriculturist.With at least 1-2 years of relevant work experience in crop protection research; preferably with people management experience. Experience in multi-national companies or large local companies are preferred.Possess knowledge on the biology and epidemiology of the target pathogens, and good agronomic practices.With technical know-how in doing field, screen-house and micro plot trials.Knowledgeable of EUP applications requirements and procedure of FPA.With good analytical and problem solving skills.Has good organizational skills, a proactive mindset, and ability to multitask and prioritize work.Express self well in English both orally and in writing.Proficient in Windows and MS Office Applications.Demonstrate leadership, professionalism and integrity at work.Proactive, can work independently and in teams.Possess a valid driver's license.  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Functional Consultant - HR Technology", "Category": "  Industry:     Chemicals / Petrochemicals    ", "Company": "Dupont", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            3-5 years                                        ", "Job Description": "  Job Description   ExternalDescription Operations Responsible for managing and executing global core configuration in Workday including, but not limited to, Core HR, Core and Advanced Compensation, Talent, Recruiting and security as a System Administrator Oversee implementation of HR changes that impact existing Workday configuration. Includes solutioning and full end-to-end delivery (i.e. discovery, design, execution, testing, support design, cutover), functional analysis and testing. Oversee solution of Workday issues/fixes, and corresponding defect management, communication, documentation, etc. Provide training and coaching to HR technology team, ensure back-up resources have knowledge of Core HR, and provide consistent feedback to HR Technology. Responsible for timely issue identification and resolution according to established SLAs. Provide Tier 2 support for case management driving and solutioning change requests. Hands on execution of change requests including build and unit testing of Workday configurations. Identify improvement opportunities and develop and implement process improvements. Includes documenting and communicating processes with stakeholders (business and technical teams). Liaison with HR Service Center regularly as well as keep closely engaged with the COEs to review new issues and concerns, provide guidance and support of timely resolution Regularly maintain the Advance Compensation and Talent & Performance modules and provide continuous improvements and updates to the modules and associated processes, features and reports. This includes, but is not limited to, updates for the Scorecard, Compensation Grade Profile Pay Ranges and STIP Targets. Oversee Annual Compensation and Talent Processes, ensuring system readiness as well as managing key steps for each process (ex. mass advance for Talent Process) Project Management Serve as Workday Operations Consultant, providing technical implementation consultation and technical support to projects Support successful execution of projects and their related transition into the ongoing maintenance process and notify appropriate stakeholders (e.g., IT, HR technology leads, HR Service Centers, etc.) Manage the relationship and project resources/HR journey partners Responsible for development and implementation of requirements and deliverables, working closely with third party vendors to ensure alignment on tasks and timelines. Liaison with key stakeholders to understand and manage down-stream impacts. Responsible for system and integration testing planning and execution Responsible for cutover planning and execution for Workday Functional and support hypercare for Workday related defect resolution. Facilitate solutions to resolve issues Ensure corporate standards and legal requirements are defined, understood and met. Ensure all stakeholders, i.e. Regional Leadership, HR Service Center employees, etc. are kept up to date with project progress via regular communications. Operations Responsible for managing and executing global core configuration in Workday including, but not limited to, Core HR, Core and Advanced Compensation, Talent, Recruiting and security as a System Administrator Oversee implementation of HR changes that impact existing Workday configuration. Includes solutioning and full end-to-end delivery (i.e. discovery, design, execution, testing, support design, cutover), functional analysis and testing. Oversee solution of Workday issues/fixes, and corresponding defect management, communication, documentation, etc. Provide training and coaching to HR technology team, ensure back-up resources have knowledge of Core HR, and provide consistent feedback to HR Technology. Responsible for timely issue identification and resolution according to established SLAs. Provide Tier 2 support for case management driving and solutioning change requests. Hands on execution of change requests including build and unit testing of Workday configurations. Identify improvement opportunities and develop and implement process improvements. Includes documenting and communicating processes with stakeholders (business and technical teams). Liaison with HR Service Center regularly as well as keep closely engaged with the COEs to review new issues and concerns, provide guidance and support of timely resolution Regularly maintain the Advance Compensation and Talent & Performance modules and provide continuous improvements and updates to the modules and associated processes, features and reports. This includes, but is not limited to, updates for the Scorecard, Compensation Grade Profile Pay Ranges and STIP Targets. Oversee Annual Compensation and Talent Processes, ensuring system readiness as well as managing key steps for each process (ex. mass advance for Talent Process) Project Management Serve as Workday Operations Consultant, providing technical implementation consultation and technical support to projects Support successful execution of projects and their related transition into the ongoing maintenance process and notify appropriate stakeholders (e.g., IT, HR technology leads, HR Service Centers, etc.) Manage the relationship and project resources/HR journey partners Responsible for development and implementation of requirements and deliverables, working closely with third party vendors to ensure alignment on tasks and timelines. Liaison with key stakeholders to understand and manage down-stream impacts. Responsible for system and integration testing planning and execution Responsible for cutover planning and execution for Workday Functional and support hypercare for Workday related defect resolution. Facilitate solutions to resolve issues Ensure corporate standards and legal requirements are defined, understood and met. Ensure all stakeholders, i.e. Regional Leadership, HR Service Center employees, etc. are kept up to date with project progress via regular communications. ExternalQualification Qualifications Bachelor's degree in Human Resources Technology, Management Information Systems (MIS), or Business field OR equivalent experience. EXPERIENCE 3-5 years of global HR process and HR technology experience 3-5 years of knowledge and experience with Workday required Experienced across multiple modules within Workday including Core HR, Talent, Performance, Advanced and Core Compensation, Recruiting, Time Tracking Strong HR technology and HR process experience and expertise Strong HR functional expertise and operations acumen Project management and integrations experience preferred Demonstrated experience utilizing HRISs (Workday, SAP, Oracle, etc.) Strong analytical skills and specifically issue triage and management skills Knowledge and experience in people management and business decision-making Experience in managing / interacting with third party HR vendors Experience in successfully managing and implementing large scale HR global integrated solutions, including system integrations Established cross country/regional leadership experience Strong leadership, interpersonal, influencing and cross-functional teamwork skills Excellent communication, writing and facilitation skillsDuPont is an equal opportunity employer. Qualified applicants will be considered without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability or any other protected class. If you need a reasonable accommodation to search or apply for a position, please visit our.For US Applicants: See the 'Equal Employment Opportunity is the Law' poster at:For our U.S. Affirmative Action Policy, .  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Chemical Analyst (Manufacturing-Cavite)", "Category": "  Industry:     Recruitment / Staffing / RPO    ", "Company": "John Clements Consultants Inc", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Controlling and leading production processesOverseeing the plating process, usage of chemicals and machines that they are working properlyCollaborating with QC/QA to assure the quality of productsReporting to the manager all problems being encounteredOther responsibilities that may be assignedQualificationsGraduate of Bachelor of Science in Chemistry or Chemical EngineeringMust have PRC licenseFresh graduates are encouraged to applyAmenable to work in General Trias Cavite  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Assistant Sales Manager", "Category": "  Industry:     Education    ", "Company": "Polytechnic University of the Philippines", "Date Posted": "Posted On: 9 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Description:a. Gather market information relevant to products for introductionb. Coordinate and align with Sales Manager on pricing and market positioning strategyc. Prepare appropriate plans to enter and develop such potential markets for approvald. Implement such plans, ensuring the coordination of required resources needed to obtain meaningful results as may be committed by the companye. Field referrals or unplanned inquiries consistent with the Business Development objectives2. Ensure compliance with the DIC Way and Corporate Governance policies in the ethical conduct of business and relevant to the fulfillment of job responsibilities.3. As a responsible member of the Management Team, support the Company's relationship-building and-maintenance efforts with its customers and stakeholders in a manner consistent with the DIC Way and Corporate Governance policies.4. Reporting and Planninga. Assist the Sales Manager in the preparation of the Company's annual sales budgetb. Monitor and ensure achievement of Business Development commitmentsc. Prepare daily activity plan, weekly and monthly review reports to the Sales Manager on the progress of Business Development activitiesi. Obtain clearance prior to making customer commitmentsii. Monitor the progress of project development timetablesiii. Prepare forecasts as may be appropriate for the level of business development status for confirmed or potential customers and productsiv. Provide input and participate in the Sales and Operations planning meetings to facilitate resource allocation and attainment of commitments to customerd. Prepare product/sales monthly reports, or as otherwise periodically required by the Regional PI Division representative, Regional Marketing Management or other Regional Office representativese. Ensure compliance with Intellectual Property policies of the Company in the maintenance of data and record accumulated relevant to the fulfillment of job responsibilities.Duties and Responsibilities:Qualifications:College graduate preferably of Chemical Engineering or Chemistry or related course. Professional license and Postgraduate studies are preferred but not required. Preferably with prior experience in the sales of printing related products and chemicals.Good communication skills in both oral and written (English and Filipino)With valid driver's license for mobility in visiting customersRequirements:Skills:Creative, Good Communication (listening, verbal, written), Leadership/Management, Critical Thinking, Decision-Making, Interpersonal Abilities, Planning/Organizing, Adaptability/Flexibility   ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Consultant", "Category": "  Industry:     IT / Computers - Software    ", "Company": "Infor SEA Pte Ltd", "Date Posted": "Posted On: 6 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            4-7 years                                        ", "Job Description": "  Job Description   A Day in The Life Typically Includes:Driven. Passionate. Committed. Our Infor Global Delivery Serves consultants deliver customizations, systems analysis, training, and client support for Infor M3 customers across the Americas, Europe, and Asia Pacific regions.We are subject matter experts of our Infor M3 product suite, capitalizing on our industry knowledge to efficiently provide our customers solutions to enhance their business processes.Infor Global Delivery Services team in Manila is looking for Business Consultants with in-depth knowledge in one or more of the following industries: Distribution, Food and Beverage, Fashion, Equipment, Chemicals. If hired, you will be a member of the Infor Global Delivery Services, a key component of the global Infor Consulting Services team, responsible for implementing Infor products for customers around the world.What You Will Need:Basic Qualifications:As an Infor Global Delivery Services Business Consultant for M3, the candidate will be required to perform the following:- Develop strong functional consulting skills surrounding Infor M3 application (and related third party) technologies and tools in order to support product customizations, modifications and related consulting/training activities.- Responsible for analyzing and interpreting client requirements and provide solutions for these requirements.- Analyze customers business requirements objectives; develops business processes to meet customers business needs.- Document and communicate the planned use of the Infor application.- Apply Infor Deployment Methodology and assist customers in using available tools to deploy the Infor solution efficiently.- Work as an integral part of the project team â€  coordinating activities with Infor project manager and working effectively with customer and Infor team members of all levels- Willingness to travel to international customer sites to deliver consulting services as well as work in the Manila office delivering our consulting services in a remote capacity.What Will Put You AheadPreferred Qualifications:-Candidate must possess at least a Bachelor's Degree in Computer Engineering, BS Industrial Engineering, BS Accountancy, Computer Science, Information Technology, Computer Information Systems, or equivalent.- At least 4 years of experience specializing in the implementation of large ERP software packages such Infor M3, Infor Lawson S3, Oracle, SAP, Microsoft (Axapta).- Must have experience with multiple (preferably 3 or more) full cycle ERP implementations related to FINANCE, SUPPLY CHAIN, LOGISTICS or MANUFACTURING- Strong business process understanding- Knowledgeable in process analysis, design and documentation- Excellent communication, presentation, organizational and planning skills- Must be collaborative to work as a team member and as a liaison with customers- Applicants must be willing to work at Bonifacio Global City, Taguig- Flexible to work on US, EMEA and/or APAC shifts when necessary- Must be willing to travel for customer facing engagements on both short and long term assignment  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Embedded Software Engineers", "Category": "  Industry:     IT / Computers - Software    ", "Company": "Accenture", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            2-5 years                                        ", "Job Description": "  Job Description   Job DescriptionWe are Industry X, the speed2value visionaries who roll up our sleeves in multi-disciplinary creative teams. We collaborate obsessively to deliver the highest quality value at lightning speed — we work fast, we work hard, and we work smart. Whether we’re racing ahead of the market on 3D printing technologies, AR/VR and wearables, coding on IoT products, or developing next-level robotics, we build the right product, make ambitious discoveries, and set the pace for what’s next. Join us as we reinvent industries such as Retail Products, Medical Tech Equipment, Media, High Tech, Aerospace and Defense, Chemicals, Mining, Oil and Gas, and Utilities. Responsibilities: • Ownership of system design and firmware on hardware prototype projects and development platforms. • Collaborating in a team environment across engineering disciplines. • Experimenting with and implementing interfaces to various sensors/peripherals. • Developing USB HID based interfaces and bootloaders. • Coding firmware to drive novel display systems and cameras. • Devising and implementing low-latency network interface protocols. • Coding programs and scripts as necessary to test embedded systems. • Work closely with various core tech teams and other organizations to define prototyping scope and applications towards various technology roadmaps and productsQualificationsBasic Qualifications: • Bachelors’ degree in Science, Engineering, or relatable technical degree • At least 2 years of experience with: o Driver and board-level system software development o Developing test frameworks using Python and Object-Oriented Programming o ARM/RISCV based processors and micro-controllers and two or more communications protocols such as I2C, UART, SPI, USB, MIPI, I2S, etc. o Board bring up and systems debugging o Debugging tools such as bus analyzers and oscilloscopes Preferred Skills: • Experience with protocol design, specification, and implementation • Experience debugging and problem solving in code bases and environments • Experience in working with FPGA, Emulators, Simulators for Chip development   ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Embedded Android App Development Application Developer", "Category": "  Industry:     IT / Computers - Software    ", "Company": "Accenture", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            5-8 years                                        ", "Job Description": "  Job Description   Job DescriptionWe are Industry X, the speed2value visionaries who roll up our sleeves in multi-disciplinary creative teams. We collaborate obsessively to deliver the highest quality value at lightning speed — we work fast, we work hard, and we work smart. Whether we’re racing ahead of the market on 3D printing technologies, AR/VR and wearables, coding on IoT products, or developing next-level robotics, we build the right product, make ambitious discoveries, and set the pace for what’s next. Join us as we reinvent industries such as Retail Products, Medical Tech Equipment, Media, High Tech, Aerospace and Defense, Chemicals, Mining, Oil and Gas, and Utilities. Responsibilities: • Design and build simple to advance TV applications using Android platform • Participate in planning of the requirements and input estimates, risks, and possible roadblock of the planned requirements • Creating and participating in continuous improvement initiatives, and advancing product quality • Performing root cause analysis of software issues/defects and improving application performance • Create and execute Unit test code for robustness, including edge cases, usability, and general reliability • Participate in peer code reviewsQualificationsQualifications: • Bachelor’s Degree in Information Technology, Computer Science, or other relevant fields • At least 5 years of experience programming with Java • At least 5 years of experience programming working with Android applications using the Android SDK, tools, and debugger or have a strong Android application experience. • In-depth knowledge and understanding of the following: - Inter-process communication (IPC): queues, pipes, sockets, shared memories, etc. - Multithreading and Processes/Threads - Data structures - Object oriented programming, design patterns and principles - Have experience using services, broadcast receivers, content providers • Experience with app architectures MVC or MVP or MVVM • Experience with one or more source control platforms such as Git • Experience with software configuration management tools, defect tracking tools, and peer review • Experience with Android or Linux subsystems Audio or Video or Picture, Bluetooth BLE, HDMI, USB, Accessibility   ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Product Marketing Manager – Rental", "Category": "  Industry:     Recruitment / Staffing / RPO    ", "Company": "Agensi Pekerjaan Ellwood Consulting Sdn Bhd", "Date Posted": "Posted On: 23 days ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            10-13 years                                        ", "Job Description": "  Job Description   Job DescriptionAbout our clientOur client is a global public listed company with office in Klan Valley that’s provides industrial machinery services.About the roleLooking for a dynamic Product Marketing Manager responsible for developing Power & Flow business for Specialty Rental South East Asia. This job will give you an opportunity to further enrich your existing knowledge and experience mainly in Power and flow with futuristic marketing activities.Your responsibilitiesMain focus will be creating a solid platform for organic growth focusing on power & flow business based in our core markets of Oil & Gas (downstream, midstream and upstream), Manufacturing (chemicals, pharmaceuticals, electronics and other general industry segments) and construction projects. Develop power business across the region while achieving ambitious growth targets with high focus on market share, customer share, penetration, and profitability for rental sales. Price management to ensure sustainable profitable growth. Restore and develop further contacts and relationships within the industries and markets making them aware of the application possibilities of our products and services. Become a focal point between division and regional sales team providing complex technical solutions/setups using and promoting solution visualization. Actively leading and participating in technical trainings for sales team and focus on increase competence within the region. This role will be leading SEA Marketing initiatives with a focus on ‘rental digital customer journey’ for the assigned product and services. Be a leader and set a good example by way of use in our ERP (Wynne), Qlickview and CRM sales tools systems (Sales Force Dot Com, Map anything, Showpad) ensuring all actions, visits, meetings etc are input into SFDC ensuring with data quality. Analyze and report on market trends and opportunities, competitor activities, economic trends and potential new market segments. Work with ASR data bases (IIR) and actively search to identify new customers, opportunities and market segments. Closely follow up future projects and provide technical support to customers and local sales staff, helping them with Marketing qualified leads and opportunities. Develop a highly effective sales network by use of territory and sales plans and working closely with and supporting local sales reps throughout the region supporting local 4D growth strategy. Work closely with fleet and operations for better coordination and fleet requirements. Continue to grow, cooperate and support other Business Areas (strong focus on CTS/PTS to - further penetrate market segments in breakdown and emergency requirements). Work with ASR Division and Regional Rental Manager for potential acquisitions in power, steam and pumps if viable. You will haveExperienced and successful person with a proven technical knowledge mainly in power generators, pumps and allied accessories. Min experience of 10 years or more in product marketing management/ Business development. Experience in similar roles will also be considered. Possession of business & Marketing acumen along with the knowledge of SEA market will be the key. The candidate has a university degree in a relevant subject or equivalent working experience. Strong Microsoft Office skills. Excellent command of English, both spoken and written, additional knowledge of local languages will be a plus.    ", "Office Location": "                                           Cagayan Valley                                      "}, {"Website:": "Monster PH", "Job Title": "Consultant", "Category": "  Industry:     IT / Computers - Software    ", "Company": "Infor SEA Pte Ltd", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            4-7 years                                        ", "Job Description": "  Job Description   A Day in The Life Typically Includes:Driven. Passionate. Committed. Our Infor Global Delivery Serves consultants deliver customizations, systems analysis, training, and client support for Infor M3 customers across the Americas, Europe, and Asia Pacific regions.We are subject matter experts of our Infor M3 product suite, capitalizing on our industry knowledge to efficiently provide our customers solutions to enhance their business processes.Infor Global Delivery Services team in Manila is looking for Business Consultants with in-depth knowledge in one or more of the following industries: Distribution, Food and Beverage, Fashion, Equipment, Chemicals. If hired, you will be a member of the Infor Global Delivery Services, a key component of the global Infor Consulting Services team, responsible for implementing Infor products for customers around the world.What You Will Need:Basic Qualifications:As an Infor Global Delivery Services Business Consultant for M3, the candidate will be required to perform the following:- Develop strong functional consulting skills surrounding Infor M3 application (and related third party) technologies and tools in order to support product customizations, modifications and related consulting/training activities.- Responsible for analyzing and interpreting client requirements and provide solutions for these requirements.- Analyze customers business requirements objectives; develops business processes to meet customers business needs.- Document and communicate the planned use of the Infor application.- Apply Infor Deployment Methodology and assist customers in using available tools to deploy the Infor solution efficiently.- Work as an integral part of the project team â€  coordinating activities with Infor project manager and working effectively with customer and Infor team members of all levels- Willingness to travel to international customer sites to deliver consulting services as well as work in the Manila office delivering our consulting services in a remote capacity.What Will Put You AheadPreferred Qualifications:-Candidate must possess at least a Bachelor's Degree in Computer Engineering, BS Industrial Engineering, BS Accountancy, Computer Science, Information Technology, Computer Information Systems, or equivalent.- At least 4 years of experience specializing in the implementation of large ERP software packages such Infor M3, Infor Lawson S3, Oracle, SAP, Microsoft (Axapta).- Must have experience with multiple (preferably 3 or more) full cycle ERP implementations related to FINANCE, SUPPLY CHAIN, LOGISTICS or MANUFACTURING- Strong business process understanding- Knowledgeable in process analysis, design and documentation- Excellent communication, presentation, organizational and planning skills- Must be collaborative to work as a team member and as a liaison with customers- Applicants must be willing to work at Bonifacio Global City, Taguig- Flexible to work on US, EMEA and/or APAC shifts when necessary- Must be willing to travel for customer facing engagements on both short and long term assignment  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Consultant", "Category": "  Industry:     IT / Computers - Software    ", "Company": "Infor SEA Pte Ltd", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            4-7 years                                        ", "Job Description": "  Job Description   A Day in The Life Typically Includes:Driven. Passionate. Committed. Our Infor Global Delivery Serves consultants deliver customizations, systems analysis, training, and client support for Infor M3 customers across the Americas, Europe, and Asia Pacific regions.We are subject matter experts of our Infor M3 product suite, capitalizing on our industry knowledge to efficiently provide our customers solutions to enhance their business processes.Infor Global Delivery Services team in Manila is looking for Business Consultants with in-depth knowledge in one or more of the following industries: Distribution, Food and Beverage, Fashion, Equipment, Chemicals. If hired, you will be a member of the Infor Global Delivery Services, a key component of the global Infor Consulting Services team, responsible for implementing Infor products for customers around the world.What You Will Need:Basic Qualifications:As an Infor Global Delivery Services Business Consultant for M3, the candidate will be required to perform the following:- Develop strong functional consulting skills surrounding Infor M3 application (and related third party) technologies and tools in order to support product customizations, modifications and related consulting/training activities.- Responsible for analyzing and interpreting client requirements and provide solutions for these requirements.- Analyze customers business requirements objectives; develops business processes to meet customers business needs.- Document and communicate the planned use of the Infor application.- Apply Infor Deployment Methodology and assist customers in using available tools to deploy the Infor solution efficiently.- Work as an integral part of the project team â€  coordinating activities with Infor project manager and working effectively with customer and Infor team members of all levels- Willingness to travel to international customer sites to deliver consulting services as well as work in the Manila office delivering our consulting services in a remote capacity.What Will Put You AheadPreferred Qualifications:-Candidate must possess at least a Bachelor's Degree in Computer Engineering, BS Industrial Engineering, BS Accountancy, Computer Science, Information Technology, Computer Information Systems, or equivalent.- At least 4 years of experience specializing in the implementation of large ERP software packages such Infor M3, Infor Lawson S3, Oracle, SAP, Microsoft (Axapta).- Must have experience with multiple (preferably 3 or more) full cycle ERP implementations related to FINANCE, SUPPLY CHAIN, LOGISTICS or MANUFACTURING- Strong business process understanding- Knowledgeable in process analysis, design and documentation- Excellent communication, presentation, organizational and planning skills- Must be collaborative to work as a team member and as a liaison with customers- Applicants must be willing to work at Bonifacio Global City, Taguig- Flexible to work on US, EMEA and/or APAC shifts when necessary- Must be willing to travel for customer facing engagements on both short and long term assignment  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Consultant", "Category": "  Industry:     IT / Computers - Software    ", "Company": "Infor SEA Pte Ltd", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            4-7 years                                        ", "Job Description": "  Job Description   A Day in The Life Typically Includes:Driven. Passionate. Committed. Our Infor Global Delivery Serves consultants deliver customizations, systems analysis, training, and client support for Infor M3 customers across the Americas, Europe, and Asia Pacific regions.We are subject matter experts of our Infor M3 product suite, capitalizing on our industry knowledge to efficiently provide our customers solutions to enhance their business processes.Infor Global Delivery Services team in Manila is looking for Business Consultants with in-depth knowledge in one or more of the following industries: Distribution, Food and Beverage, Fashion, Equipment, Chemicals. If hired, you will be a member of the Infor Global Delivery Services, a key component of the global Infor Consulting Services team, responsible for implementing Infor products for customers around the world.What You Will Need:Basic Qualifications:As an Infor Global Delivery Services Business Consultant for M3, the candidate will be required to perform the following:- Develop strong functional consulting skills surrounding Infor M3 application (and related third party) technologies and tools in order to support product customizations, modifications and related consulting/training activities.- Responsible for analyzing and interpreting client requirements and provide solutions for these requirements.- Analyze customers business requirements objectives; develops business processes to meet customers business needs.- Document and communicate the planned use of the Infor application.- Apply Infor Deployment Methodology and assist customers in using available tools to deploy the Infor solution efficiently.- Work as an integral part of the project team â€  coordinating activities with Infor project manager and working effectively with customer and Infor team members of all levels- Willingness to travel to international customer sites to deliver consulting services as well as work in the Manila office delivering our consulting services in a remote capacity.What Will Put You AheadPreferred Qualifications:-Candidate must possess at least a Bachelor's Degree in Computer Engineering, BS Industrial Engineering, BS Accountancy, Computer Science, Information Technology, Computer Information Systems, or equivalent.- At least 4 years of experience specializing in the implementation of large ERP software packages such Infor M3, Infor Lawson S3, Oracle, SAP, Microsoft (Axapta).- Must have experience with multiple (preferably 3 or more) full cycle ERP implementations related to FINANCE, SUPPLY CHAIN, LOGISTICS or MANUFACTURING- Strong business process understanding- Knowledgeable in process analysis, design and documentation- Excellent communication, presentation, organizational and planning skills- Must be collaborative to work as a team member and as a liaison with customers- Applicants must be willing to work at Bonifacio Global City, Taguig- Flexible to work on US, EMEA and/or APAC shifts when necessary- Must be willing to travel for customer facing engagements on both short and long term assignment  ", "Office Location": "                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Sr HR Services Administrator ( Korean Speaker)", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Join a team recognized for leadership, innovation and diversityTHE FUTURE IS WHAT WE MAKE ITSr HR Services Administrator ManilaAt Honeywell, we make a lot of incredible things. But most importantly, we make the future, and are looking for people to join our team global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, thinkers, innovators, dreamers and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their unique job functions. Our businesses embrace the challenges of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.Support the delivery of corporate and local human resources processes including internal transfers, promotions, terminations and administrative tracking. You will provide human resource services delivering positive results to the human resources function and employees. You will provide guidance and support to quickly resolve employee questions. Key ResponsibilitiesDrive changeImprove processesAdvise stakeholdersDeliver solutionsManage dataProvide administrative supportAnalyze dataStandardize processesYOU MUST HAVEBachelor's DegreeAble to Read & Write in Korean WE VALUEAbility to respond appropriately to customer needs and provide guidance Some administrative experience Excellent interpersonal and customer relationship skills to handle sensitive mattersStrong organizational skills Ability to navigate HR Services related technology to provide customer resolution. Effective communication and ability to communicate complex HRS replies in a clear manner.Ability to handle multiple priorities and navigate in a highly matrixed environmentAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're creating what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/If you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the EEO is the Law poster.Please refer to the EEO is the Law Supplement Poster & the Pay Transparency Policy .For more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice.If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.Copyright © 2020 Honeywell International Inc  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Sr HR Services Administrator ( Mandarin Speaker)", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Join a team recognized for leadership, innovation and diversityTHE FUTURE IS WHAT WE MAKE ITSr HR Services Administrator ManilaAt Honeywell, we make a lot of incredible things. But most importantly, we make the future, and are looking for people to join our team global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, thinkers, innovators, dreamers and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their unique job functions. Our businesses embrace the challenges of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.Support the delivery of corporate and local human resources processes including internal transfers, promotions, terminations and administrative tracking. You will provide human resource services delivering positive results to the human resources function and employees. You will provide guidance and support to quickly resolve employee questions. Key ResponsibilitiesDrive changeImprove processesAdvise stakeholdersDeliver solutionsManage dataProvide administrative supportAnalyze dataStandardize processesYOU MUST HAVEBachelor's DegreeAble to communicate in Mandarin WE VALUEAbility to respond appropriately to customer needs and provide guidance Some administrative experience Excellent interpersonal and customer relationship skills to handle sensitive mattersStrong organizational skills Ability to navigate HR Services related technology to provide customer resolution. Effective communication and ability to communicate complex HRS replies in a clear manner.Ability to handle multiple priorities and navigate in a highly matrixed environmentAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're creating what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/If you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the EEO is the Law poster.Please refer to the EEO is the Law Supplement Poster & the Pay Transparency Policy .For more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice.If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.Copyright © 2020 Honeywell International Inc  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Sr HR Services Administrator", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Join a team recognized for leadership, innovation and diversityTHE FUTURE IS WHAT WE MAKE ITSr HR Services Administrator PhilippinesAt Honeywell, we make a lot of incredible things. But most importantly, we make the future, and are looking for people to join our team global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, thinkers, innovators, dreamers and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their unique job functions. Our businesses embrace the challenges of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.Support the delivery of corporate and local human resources processes including internal transfers, promotions, terminations and administrative tracking. You will provide human resource services delivering positive results to the human resources function and employees. You will provide guidance and support to quickly resolve employee questions. Key ResponsibilitiesDrive changeImprove processesAdvise stakeholdersDeliver solutionsManage dataProvide administrative supportAnalyze dataStandardize processesYOU MUST HAVEBachelor's Degree Business Management/ Computer ScienceWE VALUEAbility to respond appropriately to customer needs and provide guidance Some administrative experience Excellent interpersonal and customer relationship skills to handle sensitive mattersStrong organizational skills Ability to navigate HR Services related technology to provide customer resolution. Effective communication and ability to communicate complex HRS replies in a clear manner.Ability to handle multiple priorities and navigate in a highly matrixed environmentAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're creating what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/If you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the EEO is the Law poster.Please refer to the EEO is the Law Supplement Poster & the Pay Transparency Policy .For more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice.If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.Copyright © 2020 Honeywell International Inc  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Sr HR Services Administrator ( Mandarin Speaker)", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Join a team recognized for leadership, innovation and diversityTHE FUTURE IS WHAT WE MAKE ITSr HR Services Administrator ManilaAt Honeywell, we make a lot of incredible things. But most importantly, we make the future, and are looking for people to join our team global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, thinkers, innovators, dreamers and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their unique job functions. Our businesses embrace the challenges of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.Support the delivery of corporate and local human resources processes including internal transfers, promotions, terminations and administrative tracking. You will provide human resource services delivering positive results to the human resources function and employees. You will provide guidance and support to quickly resolve employee questions. Key ResponsibilitiesDrive changeImprove processesAdvise stakeholdersDeliver solutionsManage dataProvide administrative supportAnalyze dataStandardize processesYOU MUST HAVEBachelor's DegreeAble to communicate in Mandarin WE VALUEAbility to respond appropriately to customer needs and provide guidance Some administrative experience Excellent interpersonal and customer relationship skills to handle sensitive mattersStrong organizational skills Ability to navigate HR Services related technology to provide customer resolution. Effective communication and ability to communicate complex HRS replies in a clear manner.Ability to handle multiple priorities and navigate in a highly matrixed environmentAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're creating what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/If you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the EEO is the Law poster.Please refer to the EEO is the Law Supplement Poster & the Pay Transparency Policy .For more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice.If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.Copyright © 2020 Honeywell International Inc  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "WMS Implementation Consultant", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            Not Specified                                        ", "Job Description": "  Job Description   Join a team recognized for leadership, innovation and diversityTHE FUTURE IS WHAT WE MAKE ITWMS Implementation ConsultantManila, PhilippinesAt Honeywell, we make a lot of incredible things. But most importantly, we make the future, and are looking for people to join our team global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, thinkers, innovators, dreamers and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their unique job functions. Our businesses embrace the challenges of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.Be part of a team that designs, develops and integrates highly complex software functions within Honeywell[SBG]. You will use your experience and judgment to plan and accomplish goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities.Key ResponsibilitiesRequirements and designSoftware architecture and codingIntegrationCertificationTestFeature DefinitionCustomer SupportVerification and ValidationAbility to code in multiple languagesAnalytical skills & software development skillsYOU MUST HAVEBachelors degree in Engineering or Computer ScienceWE VALUEUnderstanding various software development lifecycleSome relevant experienceKnowledge of software configuration management and change management practicesDiverse and global teaming and collaborationEffective communicator Wide degree of creativity and latitudeIndividuals who are self-motivated and able to work with little supervision, who consistently take the initiative to get things done, do things before being asked by others or forced to by events. Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness. Can quickly analyze, incorporate and apply new information and concepts.About UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more sustainable world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're creating what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more at careers.honeywell.com/us/en/If you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the EEO is the Law poster.Please refer to the EEO is the Law Supplement Poster & the Pay Transparency Policy .For more information on how we process your information in the job application process, please refer to Recruitment Privacy Notice.If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.Copyright © 2020 Honeywell International Inc  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "SAP ABAP Technical Support Professional", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            2-5 years                                        ", "Job Description": "  Job Description   THE FUTURE IS WHAT WE MAKE ITAt Honeywell, we make a lot of incredible things. But most meaningfully, we make the future, and are looking for people to be part of our global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, problem solvers, innovators, futurists and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their outstanding job functions. Our businesses accept the opportunities of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.We are currently seeking a Movilizer Technical Support Professional to join our Honeywell Connected Enterprise team in our Luzon, Philippines office. Working with the Technology Support Manager your focus will be analyzing and solving sophisticated Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology.Key Responsibilities:·Provide timely and courteous 24x7 technical support with a focus on high quality, accuracy, responsiveness, and customer happiness to internal staff and external customers while detailing and recording all activity according to departmental standards·Handle highly sophisticated technical queries from customers and partners in professional technical roles by fixing, researching and recreating issues end to end in an environment of distributed systems including mobile devices, clouds, and customer back ends.·Analyze proprietary software log files, stack traces as well as various related technology logs for root cause problem determination and fix software application issues at a code level, by stepping through the application logic for programs (proprietary Movilizer languages).·Develop and test small emergency software fixes and back end integrations based on the best approaches and communicate these to partners and customers.·Design, develop, test, document, and maintain tools and templates for sophisticated troubleshooting analysis·Provide software development assistance (sometimes as a billable service) to other certified solution development partners·Propose, improve, and publish knowledge management articles to continuously build and improve knowledge base·Application of functional and technical module knowledge for SAP PM/CS (Plant Maintenance / Customer Services), SAP MM (Material Management) and or SAP DSD (Direct Store Delivery), SAP FSV (Field Service Vending) in support for the Movilizer standard products, their implementations and customizations.·Remotely access customer and partner SAP systems to understand / analyze / fix system specific configurations and customizations of the above-mentioned SAP functions.·Replicate reported problems or problems that have been analyzed in customer systems in our internal SAP system landscape·Abstraction of issue scenarios to build SAP unit and scenario test templates that can be reused for fast reproduction of similar issues·Debug SAP modules, Movilizer Connector, Scenario implementations and their customizationsKey Experience & Capabilities:·Bachelor's degree in computer science, information technology, engineering, or any related field preferred·Minimum of 2 years working in a software support function preferred·SAP Technical Skills in SAP ABAPAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more balanced world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're crafting what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more atIf you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the .Please refer to the EEO is the & the .For more information on how we process your information in the job application process, please refer to .If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "SAP ABAP Technical Support Professional - copy", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            2-5 years                                        ", "Job Description": "  Job Description   Driving Infinite Possibilities Within A Diversified, Global OrganizationTHE FUTURE IS WHAT WE MAKE ITAt Honeywell, we make a lot of incredible things. But most meaningfully, we make the future, and are looking for people to be part of our global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, problem solvers, innovators, futurists and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their outstanding job functions. Our businesses accept the opportunities of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.We are currently seeking a Movilizer Technical Support Professional to join our Honeywell Connected Enterprise team in our Luzon, Philippines office. Working with the Technology Support Manager your focus will be analyzing and solving sophisticated Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology.Key Responsibilities:·Provide timely and courteous 24x7 technical support with a focus on high quality, accuracy, responsiveness, and customer happiness to internal staff and external customers while detailing and recording all activity according to departmental standards·Handle highly sophisticated technical queries from customers and partners in professional technical roles by fixing, researching and recreating issues end to end in an environment of distributed systems including mobile devices, clouds, and customer back ends.·Analyze proprietary software log files, stack traces as well as various related technology logs for root cause problem determination and fix software application issues at a code level, by stepping through the application logic for programs (proprietary Movilizer languages).·Develop and test small emergency software fixes and back end integrations based on the best approaches and communicate these to partners and customers.·Design, develop, test, document, and maintain tools and templates for sophisticated troubleshooting analysis·Provide software development assistance (sometimes as a billable service) to other certified solution development partners·Propose, improve, and publish knowledge management articles to continuously build and improve knowledge base·Application of functional and technical module knowledge for SAP PM/CS (Plant Maintenance / Customer Services), SAP MM (Material Management) and or SAP DSD (Direct Store Delivery), SAP FSV (Field Service Vending) in support for the Movilizer standard products, their implementations and customizations.·Remotely access customer and partner SAP systems to understand / analyze / fix system specific configurations and customizations of the above-mentioned SAP functions.·Replicate reported problems or problems that have been analyzed in customer systems in our internal SAP system landscape·Abstraction of issue scenarios to build SAP unit and scenario test templates that can be reused for fast reproduction of similar issues·Debug SAP modules, Movilizer Connector, Scenario implementations and their customizationsKey Experience & Capabilities:·Bachelor's degree in computer science, information technology, engineering, or any related field preferred·Minimum of 2 years working in a software support function preferred·SAP Technical Skills in SAP ABAPAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more balanced world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're crafting what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more atIf you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the .Please refer to the EEO is the & the .For more information on how we process your information in the job application process, please refer to .If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.   ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "SAP ABAP Technical Support Professional", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            2-5 years                                        ", "Job Description": "  Job Description   Innovate to solve the world's most important challengesTHE FUTURE IS WHAT WE MAKE ITAt Honeywell, we make a lot of incredible things. But most meaningfully, we make the future, and are looking for people to be part of our global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, problem solvers, innovators, futurists and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their outstanding job functions. Our businesses accept the opportunities of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.We are currently seeking a Movilizer Technical Support Professional to join our Honeywell Connected Enterprise team in our Luzon, Philippines office. Working with the Technology Support Manager your focus will be analyzing and solving sophisticated Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology.Key Responsibilities:·Provide timely and courteous 24x7 technical support with a focus on high quality, accuracy, responsiveness, and customer happiness to internal staff and external customers while detailing and recording all activity according to departmental standards·Handle highly sophisticated technical queries from customers and partners in professional technical roles by fixing, researching and recreating issues end to end in an environment of distributed systems including mobile devices, clouds, and customer back ends.·Analyze proprietary software log files, stack traces as well as various related technology logs for root cause problem determination and fix software application issues at a code level, by stepping through the application logic for programs (proprietary Movilizer languages).·Develop and test small emergency software fixes and back end integrations based on the best approaches and communicate these to partners and customers.·Design, develop, test, document, and maintain tools and templates for sophisticated troubleshooting analysis·Provide software development assistance (sometimes as a billable service) to other certified solution development partners·Propose, improve, and publish knowledge management articles to continuously build and improve knowledge base·Application of functional and technical module knowledge for SAP PM/CS (Plant Maintenance / Customer Services), SAP MM (Material Management) and or SAP DSD (Direct Store Delivery), SAP FSV (Field Service Vending) in support for the Movilizer standard products, their implementations and customizations.·Remotely access customer and partner SAP systems to understand / analyze / fix system specific configurations and customizations of the above-mentioned SAP functions.·Replicate reported problems or problems that have been analyzed in customer systems in our internal SAP system landscape·Abstraction of issue scenarios to build SAP unit and scenario test templates that can be reused for fast reproduction of similar issues·Debug SAP modules, Movilizer Connector, Scenario implementations and their customizationsKey Experience & Capabilities:·Bachelor's degree in computer science, information technology, engineering, or any related field preferred·Minimum of 2 years working in a software support function preferred·SAP Technical Skills in SAP ABAPAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more balanced world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're crafting what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more atIf you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the .Please refer to the EEO is the & the .For more information on how we process your information in the job application process, please refer to .If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Movilizer Technical Support Professional", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            2-5 years                                        ", "Job Description": "  Job Description   Innovate to solve the world's most important challengesTHE FUTURE IS WHAT WE MAKE ITAt Honeywell, we make a lot of incredible things. But most meaningfully, we make the future, and are looking for people to be part of our global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, problem solvers, innovators, futurists and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their outstanding job functions. Our businesses accept the opportunities of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.We are currently seeking a Movilizer Technical Support Professional to join our Honeywell Connected Enterprise team in our Luzon, Philippines office. Working with the Technology Support Manager your focus will be analyzing and solving sophisticated Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology.Key Responsibilities:Provide timely and courteous 24x7 technical support with a focus on high quality, accuracy, responsiveness, and customer happiness to internal staff and external customers while detailing and recording all activity according to departmental standards Handle highly sophisticated technical queries from customers and partners in professional technical roles by fixing, researching and recreating issues end to end in an environment of distributed systems including mobile devices, clouds, and customer back ends.Analyze proprietary software log files, stack traces as well as various related technology logs for root cause problem determination and fix software application issues at a code level, by stepping through the application logic for programs (proprietary Movilizer languages).Develop and test small emergency software fixes and back end integrations based on the best approaches and communicate these to partners and customers.Design, develop, test, document, and maintain tools and templates for sophisticated troubleshooting analysisProvide software development assistance (sometimes as a billable service) to other certified solution development partnersPropose, improve, and publish knowledge management articles to continuously build and improve knowledge baseApplication of functional and technical module knowledge for SAP PM/CS (Plant Maintenance / Customer Services), SAP MM (Material Management) and or SAP DSD (Direct Store Delivery), SAP FSV (Field Service Vending) in support for the Movilizer standard products, their implementations and customizations.Remotely access customer and partner SAP systems to understand / analyze / fix system specific configurations and customizations of the above-mentioned SAP functions.Replicate reported problems or problems that have been analyzed in customer systems in our internal SAP system landscapeAbstraction of issue scenarios to build SAP unit and scenario test templates that can be reused for fast reproduction of similar issuesDebug SAP modules, Movilizer Connector, Scenario implementations and their customizationsKey Experience & Capabilities:Bachelor's degree in computer science, information technology, engineering, or any related field preferred Minimum of 2 years working in a software support function preferred SAP Technical Skills in SAP ABAP About UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more balanced world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're crafting what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more atIf you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the .Please refer to the EEO is the & the .For more information on how we process your information in the job application process, please refer to .If a disability prevents you from applying for a job through our website, . No other requests will be acknowledged.  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Warehouse and Inventory Management Senior Technical Support - copy", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            2-5 years                                        ", "Job Description": "  Job Description   Innovate to solve the world's most important challengesTHE FUTURE IS WHAT WE MAKE ITAt Honeywell, we make a lot of incredible things. But most meaningfully, we make the future, and are looking for people to be part of our global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, problem solvers, innovators, futurists and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their outstanding job functions. Our businesses accept the opportunities of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.We are currently seeking a Movilizer Technical Support Professional to join our Honeywell Connected Enterprise team in our Luzon, Philippines office. Working with the Technology Support Manager your focus will be analyzing and solving sophisticated Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology.Movilizer (http://movilizer.com/) is a leading European Mobile Enterprise Application Platform (MEAP) that empowers enterprises to realize their digital transformation and deploy nimble and dynamic strategies in the field. Movilizer enables them to develop mobile business models by making any operation available on any mobile device and at the same time interconnecting them with the enterprise back-end system and with each other. The company has accompanied already over 200 multinationals successfully on their transformational journey to become interconnected, digitally augmented and mobile-enabled companies.Position SummaryThe Movilizer Technical Support Professional is responsible for analyzing and solving complex Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology. This position serves as an interface between external stakeholders and internal departments, ensuring that their technical issues, concerns, and questions are being met and new product introduction projects are successful. The role may include additional responsibilities such as systems administration, as well as developing, coaching, and monitoring technical support operations and staff.Key ResponsibilitiesMovilizer Platform Support• Provide prompt and courteous 24x7 technical support with a focus on high quality, accuracy, responsiveness, and customer satisfaction to internal staff and external customers while documenting and recording all activity according to departmental standards• Handle highly complex technical queries from customers and partners in professional technical roles by troubleshooting, researching and recreating issues end to end in an environment of distributed systems including mobile devices, clouds, and customer back ends.• Analyze proprietary software log files, stack traces as well as various related technology logs for root cause problem determination and troubleshoot software application issues at a code level, by stepping through the application logic for programs (proprietary Movilizer languages).• Develop and test small emergency software fixes in Movelets and back end integrations based on best practice approaches and communicate these to partners and customers.• Design, develop, test, document, and maintain tools and templates for advanced troubleshooting analysis• Provide software development assistance (sometimes as a billable service) to other certified solution development partners• Propose, improve, and publish knowledge management articles to continuously build and improve knowledge base• Escalate issues further into Engineering, Product Management and other Department Managers• Over 30% of the time will be spent hereKey Experience & Capabilities:·Bachelor's degree in computer science, information technology, engineering, or any related field preferred·Minimum of 2 years working in a software support function preferredAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more balanced world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're crafting what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more atIf you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the .Please refer to the EEO is the & the .For more information on how we process your information in the job application process, please refer to .If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.   ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}, {"Website:": "Monster PH", "Job Title": "Senior Warehouse and Inventory Management Senior Technical Support", "Category": "  Industry:     Electronics Manufacturing    ", "Company": "Honeywell", "Date Posted": "Posted On: a month ago", "Location": "                          Permanent Job                      ", "Status": "  Employment Types:     Full time    ", "Salary": "                                      Not Specified                                 ", "Education": "Not Specified", "Years of Work Expirience": "                                            3-4 years                                        ", "Job Description": "  Job Description   THE FUTURE IS WHAT WE MAKE ITAt Honeywell, we make a lot of incredible things. But most meaningfully, we make the future, and are looking for people to be part of our global team of future shapers. When you join Honeywell, you become a member of our performance culture comprised of diverse leaders, problem solvers, innovators, futurists and doers who are changing the future. Our people are committed to each other and to the realisation of our vision through their outstanding job functions. Our businesses accept the opportunities of innovation so that we define the future. And our global opportunities are endless for you to grow and get recognised for your passion to perform.We are currently seeking a Movilizer Technical Support Professional to join our Honeywell Connected Enterprise team in our Luzon, Philippines office. Working with the Technology Support Manager your focus will be analyzing and solving sophisticated Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology.Movilizer (http://movilizer.com/) is a leading European Mobile Enterprise Application Platform (MEAP) that empowers enterprises to realize their digital transformation and deploy nimble and dynamic strategies in the field. Movilizer enables them to develop mobile business models by making any operation available on any mobile device and at the same time interconnecting them with the enterprise back-end system and with each other. The company has accompanied already over 200 multinationals successfully on their transformational journey to become interconnected, digitally augmented and mobile-enabled companies.Position SummaryThe Movilizer Technical Support Professional is responsible for analyzing and solving complex Movilizer technology platform related problems, primarily in the area of mobile applications and cloud technology. This position serves as an interface between external stakeholders and internal departments, ensuring that their technical issues, concerns, and questions are being met and new product introduction projects are successful. The role may include additional responsibilities such as systems administration, as well as developing, coaching, and monitoring technical support operations and staff.Key ResponsibilitiesMovilizer Platform Support• Provide prompt and courteous 24x7 technical support with a focus on high quality, accuracy, responsiveness, and customer satisfaction to internal staff and external customers while documenting and recording all activity according to departmental standards• Handle highly complex technical queries from customers and partners in professional technical roles by troubleshooting, researching and recreating issues end to end in an environment of distributed systems including mobile devices, clouds, and customer back ends.• Analyze proprietary software log files, stack traces as well as various related technology logs for root cause problem determination and troubleshoot software application issues at a code level, by stepping through the application logic for programs (proprietary Movilizer languages).• Develop and test small emergency software fixes in Movelets and back end integrations based on best practice approaches and communicate these to partners and customers.• Design, develop, test, document, and maintain tools and templates for advanced troubleshooting analysis• Provide software development assistance (sometimes as a billable service) to other certified solution development partners• Propose, improve, and publish knowledge management articles to continuously build and improve knowledge base• Escalate issues further into Engineering, Product Management and other Department Managers• Over 30% of the time will be spent hereKey Experience & Capabilities:·Bachelor's degree in computer science, information technology, engineering, or any related field preferred·Minimum of 3 to 4 years working in a software support function preferredAbout UsThe world is changing. And it's a familiar story at Honeywell. Our $36 billion business was founded on a legacy of firsts spanning 130 years. We're building a safer, smarter, and more balanced world through our technology and software across each of our 930 sites globally. Our impact is seen in every shape and around the world. Our solutions are felt daily in aerospace, buildings and cities, retail, chemicals and materials, safety, industrial and manufacturing, safety, and supply chains.Discover MoreWe've been innovating for more than 100 years and now we're crafting what's next. There's a lot more available for you to discover. Our solutions, our case studies, our #futureshapers, and so much more. Learn more atIf you believe what happens tomorrow is determined by what we do today, you'll love working at Honeywell.The future is what we make it. So join us and let's do this together.Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status.For more information on applicable equal employment regulations, refer to the .Please refer to the EEO is the & the .For more information on how we process your information in the job application process, please refer to .If a disability prevents you from applying for a job through our website, request assistance here. No other requests will be acknowledged.  ", "Office Location": "                                           Central Luzon                                         ,                                           Philippines                                      "}]