[{"Website": "Workbank", "Job Title": "ServiceNow Administrator", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 21 hours ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "The ideal candidate will perform day to day support and maintenance work with the functional team to develop solutions in ServiceNow and coordinate support and development efforts within the admin team. This role will be responsible for the general support administration and maintenance of the ServiceNow platform and associated applications. They will be working closely with the ServiceNow functional team to build requested items and tasks using workflows to manage processes from the customer to the fulfillment teams. This person will develop, configure and improve core and custom applications and work directly with end users to resolve support issues. Responsibilities also include monitoring the health usage and compliance of ServiceNow as well as develop system integrations and process automation. They will have to create and configure business rules UI policies UI actions client scripts and ACLs. The candidate will have to create and configure notifications UI pages UI macros script includes formatters etc. The candidate will guide development of ServiceNow modules to help leaders measure project success by capturing data related to Cost Schedule Quality and Effectiveness coordinate application and platform upgrades load and maintain data between ServiceNow and other systems and create ServiceNow reports and dashboards.   Qualifications: Requires a Bachelor’s degree in a quantitative field including engineering math or computer science with a proven track record of out of the box thinking and an ability to think large scale"}, {"Website": "Workbank", "Job Title": "Angular Developer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 1 day ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 80,000 - 90,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "- Analyze and understand requirements provided - Apply basic to advanced Angular development - Apply basic to advanced other Front End (HTML, CSS, SASS, JavaScript) development - Suggest enhancements in Angular, HTML CSS, SASS, JavaScript which may help in webpage optimization - Apply basic to advanced bootstrap or other related technologies - Knowledgeable in nodeJS - Knowledgeable in npm - Knowledgeable in angular/cli - Develop responsive website in mobile-first or desktop-first - Perform code investigation thru debugging - Perform unit testing - Create technical documentation of activities performed such as programming and support - Provide assistance to junior members of the team - Participate in daily activities such as scrum and meeting  "}, {"Website": "Workbank", "Job Title": "API Tester", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 4 days ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 40,000 - 70,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " Participate in all Scrum ceremonies (Sprint Planning, Scrum, Review, Retrospective) Self-organizing and cross functional development Practice Agile principles Develop/implement new requirements and/or modifications to existing codes with quality based on acceptance criteria  Constantly collaborate with the team and project stakeholders Develop test cases with quality based on acceptance criteria Communicate test progress on a regular basis Communicate test execution procedure and results"}, {"Website": "Workbank", "Job Title": "QA Tester (Manual/Functional Testing)", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 4 days ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 40,000 - 75,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Self-organizing and cross functional development Practice Agile principles Constantly collaborate with the team and project stakeholders Responsible for the various standard stages such as Unit, Integration, and User Acceptance Testing Define Test Plan and Test Cases Review Test artifacts and updates stakeholders regularly on the status Monitor and Perform System Testing, System Integration, User Acceptance Testing  "}, {"Website": "Workbank", "Job Title": "Senior QA Test Engineer", "Category": "Information and Communications Technology", "Company": "SnapMart Inc.", "Date Posted": "Posted 4 days ago", "Location": "Taguig", "Status": "Full Time", "Salary": "PHP 80,000 - 130,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "In this position, you will work closely with our Back-End, Front-End and Product teams on a variety of initiatives. JOB RESPONSIBILITIES: Review product specifications and develop test plans for new products/features and ensure adequate test coverage Continuously improve existing test cases and processes to increase efficiency and reliability Reproduce, isolate, and debug issues, providing detailed bug reports Record all test results for each test suite and provide a high-level summary for areas tested Maintain proper documentation for new and existing functionality by working closely with Product Managers and Lead Engineers Estimating, prioritizing, planning and coordinating quality testing activities Creating detailed, comprehensive and well-structured test plans and test cases Suggest solutions to identified product issues JOB QUALIFICATIONS: Bachelor’s degree in Computer Science or equivalent 3+ years of experience in manual QA 2+ years of experiences in Automation Micro service testing experience is a plus API testing experience highly preferred Experience in Python is a plus SOFT SKILLS: Ability to maintain and contribute to current framework Ability to learn new technologies quickly Ability to work independently and be self-directed Upper Intermediate in English"}, {"Website": "Workbank", "Job Title": "Ecommerce Product Manager", "Category": "Information and Communications Technology", "Company": "SnapMart Inc.", "Date Posted": "Posted 4 days ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "PHP 80,000 - 130,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 5 - 8 Years ", "Job Description": "JOB SUMMARY: As a Product Manager at Snapmart, you are obsessed with problems and the subsequent discovery of its solutions. You're relentless to improve yourself, the team, and the product. You will align with the overall vision and objectives of the business and use said objectives to identify product gaps and fill them. As a product manager, you empower the product team as you serve as one of the squad leaders with the engineering team managers. You foster collaboration and serve as a conduit for the business teams, the design team, engineering teams, and other product managers. You are the voice of your users, and you represent their best interests to achieve your shared goals and visions. JOB RESPONSIBILITIES: Become the leader in the end-to-end development of products - from gathering feedback from the users to leading the discovery sessions with engineering teams and design teams to model and launch the solution Collaborate with the business teams to understand the problems and objectives validated and driven by data and analytics Responsible for the definition of the products and features. Owns the product backlog and its prioritization in collaboration with other stakeholders Lead discovery meetings with the designers and engineers to work on the technical design and prototypes making sure that builds are highly adopted by the users Writes the external and internal facing documentation of products and be responsible for the alignment of solutions with all stakeholders Ensures execution speed through prioritization: establish clear milestones with visible progress regularly, with emphasis on quick iterations Collaborate with the commercial, marketing, and operations teams to ensure the success of the product go-to-market and launch Establishes and augment development best practices, problem management, and release engineering Drives a culture of excellence, commitment, and ownership, with good execution and continuous team self-improvement. Mentor and challenge the team to grow personal and professionally JOB QUALIFICATIONS: BS degree in Computer Science or related technical field, or equivalent practical experience. An MBA would be highly desirable 5+ years’ experience managing software products and projects incl. guiding software development teams incl. hands-on involvement in system architecture, design, deployment, monitoring, performance and scalability Technical Skills: Track record of product development from conception to delivery and iteration at an Internet Product Company, having “made a difference” in product quality, with 2+ years’ experience in Social/Gaming/Content/ecommerce related projects Technical leadership experience: can delve into technical architectural decisions and explain tradeoffs; drives microservice-oriented systems and can communicate with key Computer Science concepts Familiarity with software development lifecycle and scrum framework best practices Soft Skills: Thrives in high speed execution environments, able to make scope tradeoffs without impacting desired quality Strong communication skills, in both persuasion and presentation; English speaking fluency Believes in meritocracy of ideas; rejects hierarchical decision-making; drives team consensus; breaks analysis-paralysis by planning reasonable execution paths; when needed, able to disagree and commit Identify market opportunities, build business cases, and define product vision and strategy for the company’s Products An understanding of Southeast Asia e-commerce markets, competition and customer/user requirements in depth would be preferred Excellent organizational, analytical and influencing skills"}, {"Website": "Workbank", "Job Title": "BackEnd Developer", "Category": "Information and Communications Technology", "Company": "SnapMart Inc.", "Date Posted": "Posted 4 days ago", "Location": "Taguig", "Status": "Full Time", "Salary": "PHP 80,000 - 130,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": " As a Senior Magento developer, you’ll be responsible for designing and building our eCommerce platform and others, working in a team of experienced product development and in touch with a multitude of top-notch technologies. RESPONSIBILITIES: Critically contribute in the design and execution of our product endeavors Collaborate with other engineers, designers and product managers to create innovative products Create and upgrade Magento 2 platform components, being mindful of best practices and DRY Develop performant, reusable code that you’re proud of today and hate by next week Proactively propose both product and technology improvements that you see fit Be part of, and take it as your mission to improve the agile environment that you’re working in Sample, monitor and improve the performance and security of the products you overview Be a positive energy and influence among your co-workers Be a mentor to your co-workers, and always learn from where you can QUALIFICATIONS: Relevant Bachelor’s or Master’s degree in Computer Science or related technical discipline Experience with complete eCommerce lifecycle development Good to have experience with troubleshoot on Centralize Logging System, Kibana, Newrelic and DB System Solid knowledge in PHP, MySQL and OOP Experience with Magento 2 Framework (Design Pattern, Framework structure, Dependency Injection, etc.) Strong skills in database handling Problem-solving skill and customer-oriented Experience in Dockerized applications and Kubernetes Ability to write well-documented, clean-code Ability to learn new technologies quickly Ability to work independently and be self-directed Upper Intermediate in English Adaptability NICE TO HAVE: Magento certification Experience in other backend development languages, such as Python or Golang Good to have experience on troubleshoot with Centralize Logging System, Kibana, Newrelic, etc Familiar with Gitflow, Unix/Linux environment and CI/CD Experience in eCommerce"}, {"Website": "Workbank", "Job Title": "Web Designer (w/ Call Handling Experience)", "Category": "Information and Communications Technology", "Company": "Personiv", "Date Posted": "Posted 5 days ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Associate Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsibilities Creates website designs Developing skills and expertise in appropriate website markup languages including HTML, javascript, and others Work with a wide range of digital media and web-related systems Take the design “brief” to record requirements and client needs Produce designs that are user-friendly, appealing, and effective. Amend final designs to client’s comments and gain full approval Handling calls to attend to the design modification request of client/s in a timely manner Perform other duties, which may be required by management from time to time.   Qualifications Must have Associates or Bachelors degree Keen to details Proven web designing experience Possession of creative flair, versatility, conceptual and visual ability Detail-oriented, multi-tasker, and can effectively manage multiple demands. Highly proficient in all design aspects Able to interact, communicate, and present ideas Excellent written and verbal communications skills Excellent interpersonal skills Amenable working on a Fixed NIGHT SHIFT and holidays Possess a forward-thinking positive and “can do” attitude Information Technology Skills     ** Shortlisted candidates will be required to submit a Website Design Portfolio. **"}, {"Website": "Workbank", "Job Title": "Senior DevOps Engineer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 5 days ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 100,000 - 140,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Apply cloud (AWS, Azure, GCP) computing skills to deploy upgrades and fixes Design, develop, and implement software integrations based on user feedback. Troubleshoot production issues and coordinate with the development team to streamline code deployment. Implement automation tools and frameworks CI/CD pipelines. Analyze code and communicate detailed reviews to development teams to ensure a marked improvement in applications and the timely completion of projects. Collaborate with team members to improve the companys engineering tools, systems and procedures, and data security. Optimize the companys computing architecture. Conduct systems test for security, performance, and availability. Develop and maintain design and troubleshooting documentations.  "}, {"Website": "Workbank", "Job Title": "Senior MS SQL Server Administrator", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 5 days ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 100,000 - 125,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 5 - 8 Years ", "Job Description": "Optimization of MS SQL Server and Oracle for collaboration with the Onesait Utilities Customers products Solid experience in MS SQL Server 2019 administration, implementation and tuning. Knowledgeable in Oracle 10G and higher database administration. Knowledgeable in Oracle tools and SQL scripting  "}, {"Website": "Workbank", "Job Title": "Senior Automation Engineer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 5 days ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 70,000 - 120,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Conduct code peer reviews checklist for compliance and quality. Review software documentation to ensure accuracy, compliance, and completeness. Create the overall test plan for test automation. Develop, execute and maintain automation test scripts and test suites. Familiary with POM (Page Object Model) Pattern Background in Java (OOP, Collections:List, Hashmaps, Enums, DTO Classes) Experience in TestNG, Gradle, Git Experience in API testing automation    "}, {"Website": "Workbank", "Job Title": "Mobile Developer (IOS/ANDROID)", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 1 week ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Qualifications: 3+ years of demonstrable experience Demonstrable portfolio of released applications on the App store or the Android market Extensive knowledge of at least one programming language like Swift, Java, iOS, Android, Native or Crossplatform Familiarity with OOP design principles Experience with third-party libraries and APIs Superior analytical skills with a good problem-solving attitude Ability to perform in a team environment Strong oral and written communication skills Ability to interpret and follow technical plans Duties and Responsibilities: Identify and plan for new features Develop application programming interfaces (APIs) to support mobile functionality Suggest and implement new mobile products, applications and protocols Remain up to date with the terminology, concepts and best practices for coding mobile apps Work closely with colleagues to constantly innovate app functionality and design Use and adapt existing web applications for apps Write unit and UI tests to identify malfunctions Communicate with users to understand their needs and experiences    "}, {"Website": "Workbank", "Job Title": "PowerBI Developer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 1 week ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Qualifications: BS/MS in Computer Science or Information System Experience of 4-5 years in data preparation, data gateway, and data warehousing projects Experience of 4-5 years and familiarity with Microsoft Business Intelligence Stack having Power BI Preferable with knowledge on ETL Familiarity with JavaScript, CSS, and other JavaScript libraries. Should be familiar and experienced in Python and SQL. Knowledgeable on MS Azure and Databricks is a plus Duties and Responsibilities: Power BI development and administration Building Analysis Services reporting models Developing visual reports, dashboards, and KPI scorecards using Power BI desktop Connecting to data sources, importing data, and transforming data for Business Intelligence. Translating data into informative visuals and reports. Implementation of row-level security on data and have an understanding of application security layer models in Power BI. Proficient in making DAX queries on Power BI desktop. Expertise in using advanced level calculations on the data set. Responsible for design methodology and project documentation. Develop tabular and multidimensional models that are compatible with warehouse standards. Developing, publishing, and scheduling Power BI reports as per the business requirements. - Work on prototyping, designing, and requirement analysis. Integrate Power BI reports into other applications using embedded analytics like Power BI service (SaaS), or by API automation. Develop custom visuals for Power BI."}, {"Website": "Workbank", "Job Title": "Junior Application Developer", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 1 week ago", "Location": "San Juan City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " Less than 1 Year ", "Job Description": " Responsibilities: Coordinate with managers/supervisors, and users for system workflow determination, specification, and desired features/requirements. Participate in project design, design plan preparation, and project implementation Review all code work for accuracy and functionality. Verifies program operation by confirming tests. Analyze coding segments or to analyze the plans and schematics of the applications. Plans programming projects by confirming program objectives and specifications with clients. Delivering and overseeing the training of users Database maintenance; monitoring of space consumption and regular performance of backup; normalization/cleanup of records Qualifications: Graduate of Computer Science, Computer Engineering, Software Technology or other related disciplines Proficient in programming languages/tools and web technologies such as MS Access, Visual Basic, VB.Net, Visual Interdev, Visual Source Safe, ASP, ASP.Net, MySQL, SQL Server, HTML, Java, Javascript, etc. Working knowledge or familiarity in Lotus Notes Software is a plus. Knowledge on applications development/programming; work experience in a business environment is an advantage. Strong background in systems analysis and design Ability to understand and follow production support and project processes Willing to provide on-call production/project support during off-hours Innovative and has an out-of-the-box mentality; conceptual, critical, and analytical thinking Possess winning attitude and has a strong customer service orientation"}, {"Website": "Workbank", "Job Title": "Digital Innovations Manager", "Category": "Information and Communications Technology", "Company": "Fortune General Insurance Corporation", "Date Posted": "Posted 1 week ago", "Location": "National Capital Region", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "JOB OVERVIEW : The Head of Digtial Innovations will work with the CIO to develop and implement the company's digital strategy. S/he will manage the Digital Innovations Group, as well as third-party contractors, to successfully accomplish technology-related towards Service Value Innovation. Concurrently, s/he will also act as the Deputy CIO. DUTIES and RESPONSIBILITIES : - Develop and implement, together with the CIO, the overall digital strategy. - Research on Fintech and Insurtech. - Write project proposals and technical papers. - Plan, manage, report and coordinate digital innovation projects/initiatives. Ensure successful and consistent delivery. - Hire project-based software engineering teams to accomplish deliverables. - Manage relationships with third-party partners. Ensure the performance of agreed SLAs and KPIs. - Design and implement business processes. - Coordinate with and report project results to key stakeholders. - Present and persuade senior management on deliverables. - Assist the CIO in all other aspects of running the IT operations. QUALIFICATIONS : - Graduate of any IT or business-related course. - Knowledge and experience in Insurance is preferred, but not required. - Proven track record of successfully creating and deploying digital products and services that solve both conventional and complex business solutions. - Excellent project proposal writing skills. - Excellent project management skills. - Strong presentation skills. - Strong problem-solving skills - Articulate, creative, passionate, flexible, and tenacious. - Knowledge and experience on Agile, Scrum, Design Thinking, Big Data / Analytics are definitely preferred."}, {"Website": "Workbank", "Job Title": "React Native Developer", "Category": "Information and Communications Technology", "Company": "Stacktrek", "Date Posted": "Posted 1 week ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "We’re currently looking for React Native Developers to help us build performant mobile apps on both IOS and Android platforms. Responsibilities: Design and build applications for the iOS & Android platforms. Reach out to the open source community to encourage and help implement mission-critical software fixes—React Native moves fast and often breaks things. Diagnose and fix bugs and performance bottlenecks for performance that feels native. Ensure the quality and responsiveness of applications.  Collaborate with a team to define, design and adapt new features. Help maintain code quality, organization and automation.  Skills and Qualifications: Graduate in Computer Science, Engineering, IT or relevant field Experience with building and maintaining applications for both iOS/Android platforms Experience in React Native, NativeBase, NodeJs, and REST API Rock-solid at working with third-party dependencies and debugging dependency conflicts Familiarity with code versioning tools such as Git, SVN Ability to understand business requirements and translate them into technical requirements"}, {"Website": "Workbank", "Job Title": "React Developer", "Category": "Information and Communications Technology", "Company": "Stacktrek", "Date Posted": "Posted 1 week ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "We are looking for a great JavaScript developer who is proficient with React.js. Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality product is important. Responsibilities: Developing new user-facing features using React.js Building reusable components and front-end libraries for future use Translating designs and wireframes into high quality code Optimizing components for maximum performance across a vast array of web-capable devices and browser   Skills and Qualifications: Graduate in Computer Science, Engineering, IT or relevant field Team spirit  Good problem-solving skills Experience with popular React.js workflows (such as Flux or Redux) Familiarity with newer specifications of EcmaScript Experience with data structure libraries (e.g., Immutable.js) Familiarity with RESTful APIs Knowledge of modern authorization mechanisms, such as JSON Web Token Familiarity with modern front-end build pipelines and tools Experience with common front-end development tools such as Babel, Webpack, NPM, etc. Familiarity with code versioning tools {{such as Git, SVN, and Mercuria Ability to understand business requirements and translate them into technical requirements Knowledge of isomorphic React is a plus A knack for benchmarking and optimization"}, {"Website": "Workbank", "Job Title": "IT Infrastructure Solutions Consultant", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "San Juan City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " Responsibilities: Conducts product/solution presentation, evaluation, demo or Proof of Concept (POC) and testing Will work directly with the customers, account teams, and solution architects to provide technical recommendations Work closely with various technical consultants and/or engineers to identify and resolve issues Maintain a high-level technical expertise in industry trends and technologies Qualifications: At least College graduate in any computer-related field Minimum of one (1) year of working experience in the related field is required for this position. Server and Storage experience is a MUST At least familiarity with Bill of Materials and Proof of Concept Above average written and oral English communication skills"}, {"Website": "Workbank", "Job Title": "Network Engineer", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Makati", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsibilities: Troubleshooting of servers & network-related problems; on-site diagnosis, isolation, assessment and preventive maintenance. Testing new releases of network operating systems, network software, and new server hardware, and recommending network solutions and products to customers as necessary. Maintain high-level of technical expertise in industry trends and technologies Qualifications: A degree holder in any IT or computer-related course. Minimum of three (3) years technical experience as Network Engineer / Server Engineer Excellent communication skills and with strong customer service orientation Certifications are preference but not a must Willing to work in Makati City  "}, {"Website": "Workbank", "Job Title": "IT Pre-sales Consultant", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "San Juan City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Responsibilities: Conducts product/solution presentation or demo Executes Proof of Concept (POC) and provides Scope of Work (SOW) based on recommended solutions Works directly with the customers, account teams and solution architects to help plan and design optimal solutions Works closely with various technical consultants and/or engineers to identify and resolve issues, Maintain a high-level technical expertise in industry trends and technologies Requirements: A degree holder in any Computer related course Strong background in Network Security Analysis and Design. Working knowledge on IT Security infrastructure and products such as firewall, network access control, intrusion prevention/detection, etc. Minimum 2 years related experience in IT Consultancy, Product Research, Training, and Support. Has attained any technical certification from major IT brands or IT certification institution."}, {"Website": "Workbank", "Job Title": "Field Supervisor", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Pasig", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Manage services and daily deliverables of read and bill for assigned satellite office Ensure compliance based on service level agreement Coordinate with client Manage and monitor subcontractors daily deliverables Assess and provide actions to challenges and issues of assigned satellite office Create reports Qualification: Graduated a 4 year course. 2-3 years Field Supervisor is required. Reporting experience is required Amenable to work in Ortigas, Pasig City Open for contract employment Can start ASAP."}, {"Website": "Workbank", "Job Title": "Linux System Administrator", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Mandaluyong", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "The position will report directly to the IT Specialist (Unix and Organization Resilience), of the Information and Technology Department (ITD).  The primary tasks and activities of the position are: a)    Work in the Linux team as a system administrator, providing 2nd level Linux system support; b)    Works effectively to escalate/resolve issues using agreed processes; c)    Ability to troubleshoot and resolve complex issues; d)    Follows IT governance processes used in ADB (i.e., executes Change Requests, Incident Management); e)    Install, set-up, and maintain Linux enterprise systems and related equipment; f)    Install, set-up, and maintain third-party or open-source software that are part of the core IT infrastructure (ie. backup and recovery system, Cognos, Apache); g)    Implementation of OS and Application Patches following the agreed processes; h)    Able to provide remote support in case of emergency or critical IT situation; i)    Participate in ADB Disaster Recovery (DR) exercises and familiarize DR procedures and processes when necessary; j)    Configure Datadog custom plugins to monitor Linux production systems;  k)    Create customized remote tasks using available tools and technologies; l)    Manage the Linux OVM clients using the available virtualization tools; m)    Work in a shift roster; Qualifications and Requirements The following are the minimum characteristics required: •    Minimum 4 - years’ experience in administration, installation, maintenance and troubleshooting Linux  system environments;  •    Hands-on experience working with Linux infrastructure and associated hardware; •    At least 2 years’ experience as a technical support engineer person or system administrator in Linux enterprise environment; •    Relevant experience in providing back-end support to other technical support teams; •    Relevant experience in installing and supporting Linux-based applications such as Apache, Tomcat, Postfix, LDAP, MySQL; •    Familiarity with system management tools, preferably Red Hat Satellite, RHEL Ansible and Insights; •    Familiarity with virtualization tools, preferably Oracle Virtual Manager(OVM)  and able to manage OVM clients; •    Familiarity with system monitoring tools, preferably Datadog and able to build Datadog custom plugins; •    Familiarity with  Disaster Recovery (DR) process, preferably with working experience in DR automation such as VMware Site Replication Manager (SRM); •    Familiarity with scripting and automation in a Linux environment; •    Familiarity with Linux security; •    Familiarity with Jumpstart/kickstart; •    Familiarity with Subversion, Jira, IBM and Oracle products; •    Familiarity with MS Windows 7 Enterprise and earlier; •    Preference will be given to:     Certified Linux Engineer;     Relevant working experience in a controlled enterprise environment and familiarity with ITIL framework;     Knowledge of system and network security, including knowledge of standards, policies, and technologies.  "}, {"Website": "Workbank", "Job Title": "Java Spring Boot Developer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "With at least 3 year of programming experience  with JAVA Knowledge of Object&#8208;Oriented and distributed programming principles as well as design Familiar with various design and architectural patterns Skill for writing reusable Java libraries Familiarity with concepts of MVC, JDBC, and RESTful Knowledge in XML (any combination of XML, XSLT, and XSD) Experience working with relational database system (writing SQL) Responsibilities: Implement and maintain efficient, reusable, and reliable Java code Ensure the best possible performance, quality, and responsiveness of the applications Prepare required documentation Implementing automated testing platforms and unit tests Should be able to work with Business Analysts and  QA. Start leading small team and mentor junior developers"}, {"Website": "Workbank", "Job Title": "SAP Manual Tester With FI Or SCM", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "1. Collaborate with the Test Lead 2. Help identify risks and dependencies in testing 3. Design the Test Cases based on the Test Scenarios/Functional Requirements 4. Execute testing following the Test Strategy 5. Prioritize testing tasks based on the Test Plan 6. Directly coordinate with the developers as needed 7. Identify and resolve issues related with testing 8. Know when to escalate issues to the Test Lead/Test Manager 9. Use effectively the tools in testing and test monitoring 10. Review the outputs of the testers 11. Help prepare Test Status Reports 12. Help prepare Test Summary Repor  "}, {"Website": "Workbank", "Job Title": "Android Developer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": " Design and build advanced applications for the Android platform Collaborate with cross-functional teams to define, design, and ship new features Work with outside data sources and APIs Unit-test code for robustness, including edge cases, usability, and general reliability Work on bug fixing and improving application performance Continuously discover, evaluate, and implement new technologies to maximize development efficiency"}, {"Website": "Workbank", "Job Title": "Mid Java Developer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Plaridel, Bulacan", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Advance Knowledge in Java, Object Oriented Programming Advanced knowledge in MS SQL and Oracle Knowledge in PL/SQL Knowledge in C++, Jasper Reports and API is a plus Must be willing to report on site when required Must possess problem-solving skills, accuracy and attention to detail Must be willing to guide and lead junior developers Able to work with minimal supervision"}, {"Website": "Workbank", "Job Title": "Application Support - With Oracle And SQL", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Plaridel, Bulacan", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Main task is to quickly provide solutions to the issues reported that requires permanent solution thru code changes Must be willing to work on different shifts and is open to working on holidays/weekends when required Knowledgeable in Object Oriented Programming or Java Advanced knowledge in MS SQL and Oracle Knowledge in PL/SQL Knowledge in C++, Jasper Reports and API is a plus Must be willing to report on site if and when required Must possess problem-solving skills, accuracy and attention to detail Able to work with minimal supervision"}, {"Website": "Workbank", "Job Title": "DeskSide Support", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Coron", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsibilities Serve as an escalation FTE coming for the service desk Provides on-site assistance and issue resolution to users Logs/Documents procedures for resolution from receipt to completion Contribute to Knowledge management procedures from diagnosed technical issues Suggest solutions for technical issues covering different computing platforms Mid-point to SMEs and higher tier escalation groups May be tapped to support several special applications provided by the customer Performs other related tasks from time to time Qualifications  Graduate of any 4 year Information Technology course or demonstration of historical IT commitment. At least 1 year of working experience in the related field is required for this position Fresh graduates of IT course are encouraged to apply for as long as your OJT expereince should have hardware, software applications and netwrok trouble shooting.  Candidate should be residing in Coron, Palawan.  Can Start ASAP"}, {"Website": "Workbank", "Job Title": "Technical Recruiter", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "", "Education": "College Undergraduate", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": " We are currently looking for a dynamic individual to take on the role of Technical Recruiter in our company. The position is required to: Support and fulfill IT manpower requirements of our internal business partners in compliance to the project needs of our clients Identify and recruit talent through the use of various sourcing channels such as job boards, social media, networking, referrals, job fairs etc Submit weekly, monthly recruitment related reports Manage other administrative tasks in relation to the onboarding process ROLE QUALIFICATIONS: Should be open for fixed-term engagement Can start immediately Candidate must possess at least a Bachelor's/College Degree At least 3 year(s) of working experience in the related field Solid experience in sourcing for IT talents such as Developers, RPA Devs, Solution Architects, BI Analysts, Scrum Masters, Technical Project Managers, Tech Support, Service Desk, Desk Side, Service Delivery Leads, Network Engineer, System Admin, Database Admin etc. Good verbal and written communication skills (English) Proficient in MS Office applications Pro-active Team-oriented Goal-oriented Objective Witty Attentive to detail / analytical probing nature Organized thinker (Planning, prioritization and follow-through on execution) Multi-tasking nature; ability to track and manage several assignments simultaneously Ability to treat confidential information with professionalism and discretion"}, {"Website": "Workbank", "Job Title": "Test Analyst", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 5 - 8 Years ", "Job Description": "Support the QA/Testing Manager with the planning, coordination, and control of test activities Development of test cases and scripts Documentation of the test activities and preparation of the results Coordination with business testing teams with the execution of the project's testing phases"}, {"Website": "Workbank", "Job Title": "Senior Reports Developer (Cognos)", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Experienced developing reports using Cognos Familiar operating with Oracle Database as source for Cognos Reports Experience in SQL Completed minimum 4 years of Computer Science or releated course (e.g. Computer Engineering, MIS etc.) Able to work independently"}, {"Website": "Workbank", "Job Title": "End User Support - Desk Side Support", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "Makati", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsibilities: Act as single-point-of-contact (SPOC) and provide first level technical assistance for user IT inquiries, incidents, concerns, service requests, etc. Provide information to customers which includes walkthroughs or introducing them to available information sources such as QRGs and FAQs. Answer and log the end-user call through the incident ticketing system. Escalate/endorse incidents to onsite support or SMEs if unable to resolve Job Qualification: Candidate must possess at least a Bachelors/College Degree, Computer Science/Information Technology, Engineering (Computer/Telecommunication), Science & Technology or equivalent. 1- 2 Yrs. experienced Employees specializing in Technical & Service Desk Support or equivalent. Excellent written and verbal communication skills Amenable for contract or project based employment  Amenable to work in  Makati during quarantine Can start ASAP"}, {"Website": "Workbank", "Job Title": "ServiceDesk Analyst", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 2 weeks ago", "Location": "National Capital Region", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsibilities:  Act as single-point-of-contact (SPOC) and provide first level technical assistance for user IT inquiries, incidents, concerns, service requests, etc.  Provide information to customers which includes walkthroughs or introducing them to available information sources such as QRGs and FAQs. Answer and log the end-user call through the incident ticketing system. Escalate/endorse incidents to onsite support or SMEs if unable to resolve. Job Qualification: Candidate must possess at least a Bachelor's/College Degree, Computer Science/Information Technology or equivalent. 1-2 years’ ServiceDesk or HelpDesk experience Working knowledge of fundamental operations of relevant software, hardware and other equipment Amenable for Contract or Project Based Employment  Amenable to work in Ortigas once the quarantine is lifted. Can start ASAP"}, {"Website": "Workbank", "Job Title": "Project Management Officer", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "San Juan City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Responsibilities: Create and execute project work plans within set timeline and budget. Identify resources needed and assign individual responsibilities. Manage day to day operational aspects of a project and scope. Make appropriate revisions to meet changing needs and requirements. Review deliverables prepared by team before passing to client. Qualifications: Candidate must possess at least a Bachelor's/College Degree, any field. At least three (3) years working experience in project management preferably in the IT industry. Above average communication and organizational skills. Project Management certifications, is an advantage."}, {"Website": "Workbank", "Job Title": "VAPT Specialist", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 70,000 - 80,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "QUALIFICATIONS: --  At least 2 years working experience on web and mobile application VAPT following the OWASP Top 10 testing framework --  With working experience on open source and commercial security testing tools like Kali Linux, Metasploit, Qualys, Nessus, BurpSuite, OWASP Zap, etc. --  With working knowledge on web application and mobile application development --  Must be able to write assessment reports that is understandable by both technical and non-technical audiences --  Preferably with relevant Cybersecurity certifications like CEH, CISSP, etc. RESPONSIBILITIES: --  Conduct vulnerability assessment and penetration testing on web and mobile applications --  Provide detailed assessment report and recommendations following the preferred report format of the client, if available --  Provide assistance and consultation services to teams responsible for remediations --  Organize and conduct meetings or consultation sessions, when needed, to facilitate completion VAPT sub activities --  Independently manage and complete schedule of activities or assigned tickets --  Regularly submit progress report to immediate supervisors --  Ensure confidentiality of client information at all times  "}, {"Website": "Workbank", "Job Title": "Security Engineer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Work from Home", "Status": "Contract", "Salary": "PHP 70,000 - 80,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": " GENERAL RESPONSIBILITIES - Ensures that security is embedded each phase of the system, application and infrastructure development and enhancement. - Ensure that applications, systems and infrastructure components are tested to identify vulnerabilities and that such are mitigated and managed prior Go Live. - Support the review of the RFCs. SPECIFIC RESPONSIBILITIES - Ensure deliverables are completed within timelines and within expected quality - Ensure that mitigating actions are feasible given resources and dependencies on hand - Adapt new controls and solution set for inclusion in current and future projects and change requests ADDITIONAL SKILLS REQUIREMENTS - Knowledgeable in infrastructure design for solutions/applications and application of information security and cybersecurity principles and standards in solutions architecture - Can easily adapt with current security policies, standards, procedures, and documentation"}, {"Website": "Workbank", "Job Title": "Dynamics CRM And .Net Developer", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Indra Philippines is hiring for a Dynamics CRM and .Net Developer, full time opportunity start asap. This is initially a work from home role but will eventually report in Ortigas, Pasig City once quarantine is lifted. Shape the future with Indra. Further your career in a place where technology, talent & innovation go hand in hand.     We believe in your talent. Join Indra.   Duties and Responsibilities:      Lead or participate in the design and architecture sessions with the clients, gathering and documenting business processes and requirements for the project.  Communicate with the customer on the status of the issue resolution or project. Define new architectures and drive an independent project from an architectural stand point. Enhance/customize integration with other applications.  Qualifications:  Bachelor’s degree in Information Technology, Software Engineering, Computer Science, orelated field. 3+ years’ experience of Microsoft Dynamics CRM and Dot Net development.  Preferably experienced with the following:           - Dynamics 365 Server-Side and Client-Side Object Model           - Dynamics 365 Plugins and Custom Workflow Development           - xRM Framework           - Power Platform (PowerApps, Flow, PowerBI)          - SharePoint Development Framework (SPFx)          - .NET, JavaScript, JavaScript frameworks and libraries (e.g. AngularJS, ReactJS, FabricJS, jQuery), HTML, CSS, REST APIs, XML, JSON,           SQL, and other database engines.          -  C# or Visual Basic, Visual Studio, Web Services, and the CRM SDK is preferred."}, {"Website": "Workbank", "Job Title": "QUALITY ANALYST", "Category": "Information and Communications Technology", "Company": "UNIVERSAL LEAF PHILS. INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Agoo", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The principal responsibility of a Software Quality Analyst is to evaluate, troubleshoot and test the software repeatedly in search of bugs and errors. These problems with the software are then logged, prioritized, and tracked by the developers.  "}, {"Website": "Workbank", "Job Title": "PROGRAMMER", "Category": "Information and Communications Technology", "Company": "UNIVERSAL LEAF PHILS. INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Agoo", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The Programmer develops, designs, tests, and maintains the company’s application systems. To customize, modify and integrate “off the shelf” software into in-house develop systems to meet the needs of the business.  "}, {"Website": "Workbank", "Job Title": "Cellphone Repair Technician", "Category": "Information and Communications Technology", "Company": "HI - FACTOR IONTECH DIGITAL INDUSTRIES CORP.", "Date Posted": "Posted 3 weeks ago", "Location": "Batac City", "Status": "Full Time", "Salary": "PHP 0 - 10,000", "Education": "Technical/ Vocational Course", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "CELLPHONE REPAIR TECHNICIAN  MALE, 20 to 30 years old  Candidate must possess at least Associate Degree or Diploma in Electronics NCII certificate holder is an advantage  Proficient in computer skills and have knowledge of operating different types of mobile phones  With strong reading personality  Trustworthy   "}, {"Website": "Workbank", "Job Title": "IT Officer", "Category": "Information and Communications Technology", "Company": "Mt. Labo Exploration and Development Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Labo", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsible in installation and configuration of computer hardware, software, systems, networks, and printers, etc. Monitor and maintain computer systems and networks, which includes documentation.  "}, {"Website": "Workbank", "Job Title": "IT Service Desk Support", "Category": "Information and Communications Technology", "Company": "Industrial Personnel and Management Services, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Quezon City", "Status": "Full Time", "Salary": "", "Education": "College Undergraduate", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Task Description: Trouble shoot Wireless Issues IPhone and Mobile Device password resets Quanta System Password Resets * (Must know Microsoft Active Directory) VPN configuration Research and resolve outstanding Tickets Support International Units IT support Respond to assigned tickets in a timely manner with details Quanta Email Solution * (Microsoft Exchange) Active Directory Issues  "}, {"Website": "Workbank", "Job Title": "LINUX SYSTEM ADMINISTRATOR", "Category": "Information and Communications Technology", "Company": "Daily Overland Freight Forwarder", "Date Posted": "Posted 3 weeks ago", "Location": "Daraga", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " 1. Minimum experience of at least 2 years in Managing and Supporting Production Servers in Linux environment (UBUNTU Desktop and Live Server) 2. Must have experience installing and setting up Linux system and server from the scratch. 3. Experience handling Load balancers / firewall/ security application 4. Knowledge on WEB caching tools Nginx/Varnish 5. Good knowledge on Linux/Unix command 6. Administration of Linux File Systems and swap space management 7. Administration and Management of LVM (Logical Volume Management) 8. Good understanding about Linux OS environment variable settings 9. Knowledge about Active Directory/User Account Management/USer Access Control 10. Maintain and Manage MySQL Server, knowledge on data replication is a must    "}, {"Website": "Workbank", "Job Title": "Senior Full Stack Developer", "Category": "Information and Communications Technology", "Company": "Red Core IT Solutions, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "PHP 80,000 - 90,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 5 - 8 Years ", "Job Description": "Skills Requirements: ·         Bachelor's degree : Computer Science, Information Technology or related course ·         Senior Level (3 to 5 years and above experience in development of applications using JAVASCRIPT + CSS, NODE JS & REACT JS Framework, SERVERLESS (, API Gateway AWS, Lambda), NO SQL (DynamoDB)   ·         Engineer must have a technical background with at least 3 - 5 years of work experience in one or more IT areas including but not limited to:           ‣‣ IT architecture, infrastructure, and cloud engineering         ‣‣ Engineering and software architecture design         ‣‣ Business analysis         ‣‣ DevOps         ‣‣ Project and product management   ·         Should have the following attributes:    ‣‣ Excellent communication skills    ‣‣ Deep analytical skills    ‣‣ Project and resource management skills    ‣‣ Work collaboratively    ‣‣ Influence and Negotiate ·         Amenable to start immediately  "}, {"Website": "Workbank", "Job Title": "IT PROGRAMMER", "Category": "Information and Communications Technology", "Company": "Daily Overland Freight Forwarder", "Date Posted": "Posted 3 weeks ago", "Location": "Daraga", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "1.       At least with 4 years degree in IT or other related computer course 2.       With or without work experience 3.       Knowledgeable in programming languages (e.g. CSS, HTML, PHP, Javascript, etc) 4.       Knowledgeable in Database Management and Configuration (MySQL, MySQL Workbench) 5.       Knowledgeable in Software Development Life Cycle (SDLC) 6.       Knowledgeable in APACHE and NGINX Server 7.       Knowledgeable in Linux operating system (desictop & server version) 8.       Experience in using unified threat management software and hardware  9.       The ability to communicate complex procedures to others 10.   With good moral character 11.   Hardworking and flexible 12.   Physically fit  13.   Deadline driven. 14.   Aptitude for learning new technology. 15.   Creative mind and analytical thinking  "}, {"Website": "Workbank", "Job Title": "CONTENT WRITER", "Category": "Information and Communications Technology", "Company": "Intelliwork Outsourcing Philippines, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Legazpi City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Main responsibilities/tasks of the job include but is not limited to: Creating write-ups or abstracts for online seminars or webcasts by conducting his/her own research using the internet and other search engines such as Google, Yahoo, ask.com, etc… Ensure that all web contents for publishing are well-written by reviewing the write-up and correcting any grammatical, typographical or compositional errors. Plagiarism is strictly prohibited for this position. Qualifications: With a Bachelor’s Degree in Journalism, Mass Communication or any related courses (other bachelor degree courses are welcome as well as long as you have an excellent grammatical and analytical skills especially in writing) Fresh graduates are welcome to apply as long as the candidate possesses strong writing and editorial skills and/or experience gained from school (school newspaper or publication) and other related experience Must possess excellent oral and technical writing skills in English language Detail-oriented, can beat deadlines and work under pressure with less supervision Internet savvy with background in topic research and development Team player and work in a collaborative team environment With excellent work ethics and a positive influencer to the team"}, {"Website": "Workbank", "Job Title": "SENIOR WORDPRESS DEVELOPER", "Category": "Information and Communications Technology", "Company": "Intelliwork Outsourcing Philippines, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Legazpi City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Main responsibilities/tasks of the job include but is not limited to: Overseeing Junior Web Designers and Developers on projects and supporting various development duties Write code, perform code assignments, analyze data and contribute to design and implementation Coordinate with project management and plan schedules/technical direction Review code work for accuracy and functionality Create and implement design plans Delegate related tasks to team members Perform performance evaluation of members and work collaboratively with the Management in ensuring compliance of the Standard Operating Procedures (SOPs) of the company Conduct meetings and handle concerns in accordance with the established policies Keep up-to-date with industry trends/technology developments Conduct trainings and other continuous learning activities for team members Qualifications: With a Bachelor’s Degree in Programming, Information Technology, Computer Science and other computer-related courses With qualities of a leader and can lead a team effectively With excellent collaboration skills and can work with different teams efficiently At least 3-5 years work-related experience With working knowledge and advance skills in WordPress, HTML, CSS, Photoshop, Dreamweaver, Flash, FTP, ASP programming and other web design and development tools Hard coder and with great coding skills Can determine and fix website speed issues and glitches Can improve the site speed strategies Creative and artistic when it comes to web design and development With good oral and written communication skills Flexible, attentive to details and can multi-task Can work under pressure and with minimum supervision Optimistic and with “can do” attitude With excellent work ethics and a positive influencer to the team"}, {"Website": "Workbank", "Job Title": "JUNIOR SOFTWARE PROGRAMMER", "Category": "Information and Communications Technology", "Company": "MUTI GROUP OF COMPANIES", "Date Posted": "Posted 3 weeks ago", "Location": "Koronadal City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "      JOB QUALIFICATIONS:  Graduate of BS Information Technology, BS Computer Engineering, Computer Science or any related course  With or without experience  Familiar with Windows & Linux Platforms  Excellent in Databases- MySQL & Postgresql  Knowledge on Javascript, Python, Node.js, XML,HTML and DJango is an advantage  For Koronadal City assignment"}, {"Website": "Workbank", "Job Title": "Java Web Developer | Malate", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 4 weeks ago", "Location": "Manila", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Understands the technical specifications and design and translate it to program code  Develops web-based applications and implement features and functionalities using Java Programming Language  Follows approved systems / applications life-cycle methodologies, creates design documents, and performs program coding and testing  Resolves technical issues through debugging, research and investigation  Creates relevant technical documentation and manual for the applications  Provides technical support to users  Qualifications: Work experience using Java Web Programming  Knowledge on architecture patterns especially MVC  Experience in usingweb servers (WebSphere Application Server, Tomcat, Glassfish, etc.)  Knowledge on SDLC  Able to present technical information to others with clarity, including small and large audiences  Flexible and analytical  Good interpersonal and communication skills  "}, {"Website": "Workbank", "Job Title": "Business Analyst In Ortigas", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 4 weeks ago", "Location": "Pasig", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Graduate of Computer Science or any IT related course 1 to 2 years of experience in the Business/Functional Analyst role or an equivalent practical experience Excellent practical skills in Microsoft Office applications (Word, Excel, PowerPoint, Outlook; MS Visio/MS Project is a plus) Practical knowledge on client/server and mobile operating systems (e.g. Windows Server; Android OS is a plus) Practical knowledge and understanding on software testing concepts/scenarios, testing methods, test cases, test scripts, and test tools - Good knowledge and understanding of database concepts and DBMS (e.g. Microsoft SQLserver, MySQL; actual practical experience is a plus) Understanding of at least one development platform (e.g. Java, C++, Visual Basic, PHP) Understanding of usual business and IT key performance indicators (KPIs) - Analytical thinking, with problem solving (root-cause analysis), and data visualization skills Familiar with systems analysis and design concepts Familiar with software/systems development frameworks and methodologies (e.g. SDLC, Agile/Waterfall, etc.) Familiar with the ITIL v3/v4 service lifecycle/framework Detail-oriented and capable of delivering a high level of accuracy Good oral communication and technical writing skills Good interpersonal and consultative skills"}, {"Website": "Workbank", "Job Title": "Release And Transition Management Specialist", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 1 month ago", "Location": "Pasig", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Indra Philippines is hiring for a Release and Transition Management Specialist, 8 months' contract, extendable, start asap. This is initially a work from home role but will eventually report in Ortigas, Pasig City once quarantine is lifted. Shape the future with Indra. Further your career in a place where technology, talent & innovation go hand in hand.     We believe in your talent. Join Indra.   Duties and Responsibilities:     Work closely with product teams and service owners to ensure successful transition of change from development to Production.  Understand full release schedules and business goals behind each release.  Clearly communicate issues, impact, and possible options as they arise, and develop action plans through partner collaboration.  Identify risks in advance and drive the team towards successful resolution before the risks turn into incidents.  Ensure compliance with all requirements for release and transition.  Identify and remove roadblocks that prevent the team from performing to their highest potential.  Coordinate and lead efforts across a large cross-functional teams. Provide regular status on the state of releases, transition, risks, and mitigations.    Qualifications:  Graduate of any Information Technology course. 4-6 years’ working experience in managing releases and transition of change from Development to Production. Exceptional Project Management and Organization Skills.   Preferred skills: With Change Management knowledge and experience. Have development or programming background.  "}, {"Website": "Workbank", "Job Title": "Senior SAP Warehouse Management Consultant", "Category": "Information and Communications Technology", "Company": "Indra Philippines, Inc.", "Date Posted": "Posted 1 month ago", "Location": "Makati", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 5 - 8 Years ", "Job Description": "Indra Philippines is hiring for a Senior SAP Warehouse Management (WM) Consultant, 3 months' contract, extendable, start asap. This is initially a work from home role but will eventually report in Makati City once quarantine is lifted. Shape the future with Indra. Further your career in a place where technology, talent & innovation go hand in hand.     We believe in your talent. Join Indra.   Duties and Responsibilities:      Identify process/system gaps and propose solutions. Analyze & translate user requirements into functional / technical specifications. Develop and implement system configurations / enhancements. Accomplish required documents such as functional / technical specifications. Create and execute sound test strategies, plans, and cases. Provide implementation support and address defects.    Qualifications:  Graduate of any four year IT related course or above.        5-10 years’ experience as an SAP WM Consultant.    Experienced with SAP WM’s end to end implementation and support. Can start asap.    "}, {"Website": "Workbank", "Job Title": "Administrative Staff", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 1 month ago", "Location": "Angeles City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "1. Resolves administrative problems by coordinating preparation of reports, analyzing data, and identifying solutions. 2. Prepare transmittal, DAR, and Permit-to Bring-In for incoming goods. 3. Filing of documents. 4. Ensures operation of WHSE equipment by completing preventive maintenance requirements; reporting for repairs; maintaining equipment inventories; evaluating new equipment and techniques. 5. Maintains WHSE office supplies inventory by checking stock to determine inventory level; anticipating needed supplies. 6. Purchase requisition and transfer posting of goods on SAP. 7. Contributes to team effort by accomplishing related results as needed  "}, {"Website": "Workbank", "Job Title": "Web Designer", "Category": "Information and Communications Technology", "Company": "Personiv", "Date Posted": "Posted 1 month ago", "Location": "Muntinlupa", "Status": "Full Time", "Salary": "", "Education": "Associate Degree", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "Responsibilities Creates web site designs Developing skills and expertise in appropriate website markup languages including html, java script and others Work with a wide range of digital media and web related systems Take the design “brief” to record requirements and client needs Produce designs that are user friendly, appealing, and effective. Amend final designs to client’s comments and gain full approval Perform other duties which may be required by management from time to time.   Qualifications Must be an Associate/Bachelor's degree graduate Possession of creative flair, versatility, conceptual and visual ability. Detail-oriented, multi-tasker and can effectively manage multiple demands. Able to interact, communicate and present ideas. With experience in creatng web design projects (either for school or work) -- portfolio will be presented during the application process Amenable working fixed night shift schedule/US hours, including holidays Knowledgeable in HTML, CSS, Javascript Knowledgeable in Adobe Photoshop Can start ASAP Amenable to work in Alabang, Muntinlupa City once work-in-office resumes"}, {"Website": "Workbank", "Job Title": "Technical Support Engineer", "Category": "Information and Communications Technology", "Company": "Integrated Computer Systems, Inc.", "Date Posted": "Posted 1 month ago", "Location": "Makati", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "Accurate and timely delivery, replacement and pull-out of customer replaceable units that doesn’t require technical expertise or certification. Assistance to Infrastructure Support Engineer/Infrastructure Support Associate on their assigned services Accurate & timely feedback to tickets assigned Accurate, timely and complete submission of work order copies Customer Satisfaction"}, {"Website": "Workbank", "Job Title": "VP For IT", "Category": "Information and Communications Technology", "Company": "Synchrony Global Services Philippines Inc.", "Date Posted": "Posted 2 months ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "PHP 175,000 - 200,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 10 - 15 Years ", "Job Description": "Job Description Summary: The Vice President - IT is a senior level employee who will be responsible for the support of the business center personnel and technologies that support the infrastructure and productivity 7000+ SYF employees located in the Philippines at our sites in Manila and Cebu. Essential Responsibilities  • Work with Business Leader, Operating Leaders for Manila and Cebu and SYF technology leaders to help achieve business and technology goals and objectives.  • Drive Business IT Goals and Objectives for sites in Manila and Cebu by working closely with the site leader and operating leaders.  • Partner and Collaborate with the Enterprise Technology Leaders to deploy enterprise solutions and drive seamless collaboration and communication.  • Work on projects/programs for the company.  • Work with business teams and relevant IT teams to shape strategies to meet site specific business needs for the various enterprise operations and support functions that are in alignment with SYF Technology standards and overall technology strategy for the sites at Manila and Cebu.  • Work cross functionally with business teams and relevant information technology team members to shape business requirements and initiate projects/programs to fulfill them.  • Develops peer, cross functional and cross business relationships to maximize best practice sharing and team effectiveness.  • Own the Information Technology communications strategy for the site to socialize enterprise wide initiatives locally on site and build buy in and awareness.  • Maintain up to date knowledge of technology trends and standards and work as a partner to the business to promote their use.  • Identifies new opportunities to drive system improvements and simplification in support of productivity.  • Ensures process rigor and adherence to program methodology standards waterfall and agile.  • Drive compliance with enterprise standards, policies and procedures  • SLA monitoring and performance tracking for in country vendors.  • Lead onsite diagnosis and resolution of IT related issues using the standard diagnostic tools and techniques  • Drive root cause analysis on incidents and partners with enterprise operations operating leaders and technology leaders to ensure consistently high availability of technology infrastructure for the business at respective sites.  • Drive security standards and compliance.  • Operationalize roundtable feedback across all business centers and integrate into business and IT assessment processes for implementation.  • Own communication of roundtable feedback and updates.  • Uphold and adhere to the Information Security policies and guidelines. Ensure that all Information security policies and guidelines are enforced and implemented.  Ensure that all direct reports uphold and adhere to these policies and guidelines. To report all violations and gaps observed and institute corrective actions accordingly.  • Responsible for technology P&L for the sites in Manila and Cebu. • Liaison for regulatory compliances related to technology and engage support functional leads for PEZA audits. Qualifications/Requirements   • Bachelor’s/College Degree in Computer Science/IT or Computer/Telecom Engineering with 15 years + of Information Technology experience.  • Minimum of 10+ years of BPO Technology Infrastructure and program management experience in management roles with a user base of 4000+ employees.  • Willing to work on night shifts and respond to emergencies 24X7.  • Proven track record of acting as a strategic IT business partner with senior leadership  • Proven track record of Managing EUS Infrastructure, Datacenter infrastructure, Network Infrastructure technology team comprising of vendors and FTE, Contact center technologies and enterprise applications.  • Proven ability to lead and motivate teams in a matrix environment  • Demonstrated ability to drive change and work effectively across business boundaries  • Superior decision-making, client relationship, and vendor management skills.  • Superior oral and written communication skills, as well as the ability to manage expectations of the business, clients, team members, management and external groups  • Strong understanding of contact center technology trends and providers  • Excellent facilitation/influencing skills at all levels of the organization and demonstrated ability to interact with cross functional/cross cultural teams.  • Agile Safe Certification “Leading Safe” would be highly desirable.  Desired Characteristics  • Strong business acumen including a broad understanding of financial services business processes and practices.  • Good decision making and problem-solving skills.  • Self-started and quick learner.  • Strong attention to detail.  • Demonstrated effectiveness in driving change.  • Demonstrated competency with linking business strategy with IT technology initiatives.  • Strong customer focus and ability to manage customer expectations."}, {"Website": "Workbank", "Job Title": "Software Quality Analyst", "Category": "Information and Communications Technology", "Company": "Gardenia Bakeries Philippines, Inc.", "Date Posted": "Posted 2 months ago", "Location": "Biñan City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Identifying the organization’s business needs through communication with the customer. Able to understand and create process diagrams, use cases, and user stories. Knowledge of technical specifications to ensure understanding of the project and the proposed enhancements. Testing the system for errors, bugs, and interoperability, while organizing & tracking progress and evaluating for performance. Ensuring that all work products are properly coordinated with the appropriate stakeholders and meet or exceed quality standards and tracking the progress of critical dates to ensure the delivery of a successful project QUALIFICATIONS: Bachelor's Degree in Computer Science, Computer Engineering or equivalent At least 2 years of experience in software quality and manual testing "}, {"Website": "Workbank", "Job Title": "Senior Python Backend Engineer", "Category": "Information and Communications Technology", "Company": "OUTLIANT", "Date Posted": "Posted 2 months ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Take your career to the next level at Outliant! Here you have the opportunity to lead innovative projects on modern technology as a Senior Python Developer. Grow and learn from other world class engineers on our team! You can choose your own hours, get paid to learn new skills, and lead new projects from the ground up. We develop software for many top companies and startups around the world, as well build our own internal products. We offer salary, paid time off, 13th month (EOY) bonus, and more. Communicate with our team in slack in a casual environment where you can make a huge impact!   We are in need of a full time developer who is an expert in the following:   Expertise in backend development using python Rest APIs using libraries such as flask or django Database experience such as Postgres, mongodb, elasticsearch, mysql, etc DevOps experience with cloud hosting on platforms such as AWS   A candidate should have their own computer and stable internet connection to apply. We want a full-time employee that is only working for us and able to commit around 40 hours per week. You are in charge of your own hours. We are extremely kind people who focus on cooperation, autonomy, and mastery. We will train you to be the best you can be and are ALWAYS here to help should you get stuck. The goal is for you to develop into a self-sufficient individual who adds tremendous value to the team.   The interview process will involve hopping in a skype call to discuss your skillset.   We are excited to speak with you and help you take your career to new heights :)   p.s. We have a highly experienced team that is here to teach and train you. We've got your back!   ***In order to interview you will have to fill out this application: http://hiring.outliant.com/   Requirements Expertise in backend development using python Rest APIs using libraries such as flask or django Database experience such as Postgres, mongodb, elasticsearch, mysql, etc DevOps experience with cloud hosting on platforms such as AWS  "}, {"Website": "Workbank", "Job Title": "Senior React Developer", "Category": "Information and Communications Technology", "Company": "OUTLIANT", "Date Posted": "Posted 2 months ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Take your career to the next level at Outliant!   Here you have the opportunity to lead innovative projects on modern technology as a Senior React Developer. Grow and learn from other world class engineers on our team! You can choose your own hours, get paid to learn new skills, and lead new projects from the ground up. We develop software for many top companies and startups around the world, as well build our own internal products.   We offer salary, paid time off, 13th month (EOY) bonus, and more. Communicate with our team in slack in a casual environment where you can make a huge impact!   We are in need of a full time developer who is an expert in the following: Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model Thorough understanding of React.js and its core principles Experience with popular React.js workflows (such as Flux or Redux) Familiarity with ES6 standards Node.js Experience Experience with data structure libraries (e.g., Immutable.js) Familiarity with RESTful APIs Knowledge of modern authorization mechanisms, such as JWT Familiarity with modern front-end build pipelines and tools Experience with common front-end development tools such as Babel, Webpack, NPM, etc. Ability to understand business requirements and translate them into technical requirements A knack for benchmarking and optimization Bonus Skills: Typescript React Hooks   Additionally, experience with some of the below technologies is preferred but not required. [] Semantic UI (or tell me other UI framekworks you know like UI Kit 3, Bootstrap, etc.) [] Highcharts [] Chart.js [] Stripe [] EJS [] Handlebars [] DynamoDB [] ElasticSearch [] CosmosDB [] Firestore [] MongoDB [] Grunt.js [] Moment.js [] S3 [] Babel [] AWS (which AWS technologies are you familiar with?) [] Google Cloud [] Azure [] Mailgun [] Twilio   A candidate should have their own computer and stable internet connection to apply. We want a full-time employee that is only working for us and able to commit around 40 hours per week. You are in charge of your own hours. We are extremely kind people who focus on cooperation, autonomy, and mastery. We will train you to be the best you can be and are ALWAYS here to help should you get stuck. The goal is for you to develop into a self-sufficient individual who adds tremendous value to the team.   The interview process will involve hopping in a skype call to discuss your skillset.   We are excited to speak with you and help you take your career to new heights :)   p.s. We have a highly experienced team that is here to teach and train you. We've got your back!   Do you mind submitting our hiring application here: http://hiring.outliant.com/   After you submit the form we will be able to schedule an interview.    "}, {"Website": "Workbank", "Job Title": "Senior React Native Engineer", "Category": "Information and Communications Technology", "Company": "OUTLIANT", "Date Posted": "Posted 2 months ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Take your career to the next level at Outliant! Here you have the opportunity to lead innovative projects on modern technology as a full-stack developer. Grow and learn from other world class engineers on our team! You can choose your own hours, get paid to learn new skills, and lead new projects from the ground up. We develop software for many top companies and startups around the world, as well build our own internal products.   We offer salary, paid time off, 13th month bonus, and more. Communicate with our team in slack in a casual environment where you can make a huge impact!   We are in need of a full time developer with experience in the following:   At least 1 year experience building a React Native project Understanding of functional programming and React Hooks Knowledge in testing using Jest, React Native Testing Library, React Test Renderer Javascript ES6 Typescript / Flow Redux / Redux Saga Can translate design to CSS and reusable components Keen on optimization, clean readable code and refactoring Git and Github Familiar with Jira and Agile Attention to detail Team player Experience using Sourcetree is a bonus (not required)   A candidate should have their own computer and stable internet connection to apply. We want a full-time employee that is only working for us and able to commit around 40 hours per week. You are in charge of your own hours.   We are extremely kind people who focus on cooperation, autonomy, and mastery. We will train you to be the best you can be and are ALWAYS here to help should you get stuck. The goal is for you to develop into a self-sufficient individual who adds tremendous value to the team.   The interview process will involve hopping in a skype call to discuss your skillset.   We are excited to speak with you and help you take your career to new heights :)   p.s. We have a highly experienced team that is here to teach and train you. We've got your back!   Do you mind submitting our hiring application here: http://hiring.outliant.com/   After you submit the form we will be able to schedule an interview.  "}, {"Website": "Workbank", "Job Title": "IT Business Analyst", "Category": "Information and Communications Technology", "Company": "Gardenia Bakeries Philippines, Inc.", "Date Posted": "Posted 3 months ago", "Location": "Biñan City", "Status": "Full Time", "Salary": "PHP 30,000 - 35,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Bachelor’s Degree in Computer Applications Development or equivalent Knowledge of business processes, computing principles and computing terminology used in describing procedures for using computer hardware and software applications Knowledge of procedures for technical documentation design and organization Has the ability to use written English, grammar, spelling and punctuation to create, edit and revise technical computer documentation for an academic, information technology or business audience Has the ability in organizing information in a concise, cohesive manner Has the ability in operating database, word processing, and publication software experience Innovative in forming ideas Skilful in organizing ideas and turning these to solutions Good in conveying concise but comprehensible specifications Proficient in oral and written communication"}, {"Website": "Workbank", "Job Title": "Senior Applications Developer", "Category": "Information and Communications Technology", "Company": "Fortune General Insurance Corporation", "Date Posted": "Posted 3 months ago", "Location": "Pasig", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "The Senior Applications Developer will architect, create, test, document, and the next generation of our Core Insurance System. S/he is a hands-on platform builder of scalable e-commerce and data applications. S/he will collaborate with Sales & Marketing, Underwriting, Claims, and Finance to fulfill project requirements, in support of the company's Digital Transformation Strategy. S/he must have strong technical competence in Object-Oriented Programming (OOP); coding Model-View-Controller (MVC) Applications; using one or more full-stack frameworks (HTML5 + CSS3 + any Javascript + RDBMS + any OOP language + Linux skills). S/he must be ease working with little supervision and tight deadlines. S/he must be highly capable, motivated, loves tackling problems head-on and enjoys coming up with creative solutions. S/he must be able to constantly be updated with hardware and software advancements.   Duties and Responsibilities: - Collaborate with various teams to diagnose problems in operations. - Conduct systems analysis and (re)design business processes. - Design, develop, test, deploy, maintain MVC, and/or mobile applications. - Automate business processes. - Create our own APIs. Connect to third-party APIs. - Train junior coders. - Assist the CIO in continuously developing and implementing the Digital Transformation Strategy.   Qualifications: - Graduate of any IT or Engineering course. - Knowledge and experience in Insurance is preferred, but not required. - Proven experience developing clean code for MVC Applications. - Proven experience in the following domains :       > Flowcharting       > HTML5       > CSS3       > Javascript (e.g. Jquery, Coffeescript, React, etc.)       > SQL       > OOP (e.g. C++, Python, Ruby, etc.)       > Linux       > Apache or Nginx       > Test-Driven Development       > Cloud (e.g. AWS or any VPS)       > DevOps       > APIs, REST, SOAP       > Git       > Android and/or iOS development (a strong plus) - Entrepreneurial skills and experience are preferred. - Must be a leader and a problem-solver. - Must be a smart and fast coder. - Can write technical documents. - Must be able to teach junior coders. - Must be a fast-learner, and willing to learn Ruby on Rails.                                           "}, {"Website": "Workbank", "Job Title": "GENIISYS GENWEB And ORACLE DB Administrator", "Category": "Information and Communications Technology", "Company": "Fortune General Insurance Corporation", "Date Posted": "Posted 3 months ago", "Location": "Pasig", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "The GENIISYS/GENWEB and ORACLE DB Administrator is responsible for maintaining a reliable, secure, and efficient Core Insurance System (CIS). S/he will work with all units to ensure smooth business operations. As a DBA, s/he shall ensure the quality and integrity of the database/s. S/he must have superior technical, analytical, and problem-solving skills, coupled with the ability to communicate with all levels in the organization.  S/he must be able to constantly be updated with hardware and software advancements.     Duties and Responsibilities: GENIISYS/GENWEB Administration Manage and support the company’s Core Insurance System (GENIISYS/GENWEB). Ensure that the CIS works well with the IT infrastructure. Deploy and update CIS releases/patches. Create and verify backups. ·        Set-up and maintain user accounts, roles, and permissions. ·        Work with the Helpdesk Engineer and CPI to resolve problems reported by end users. ·        Monitor CIS performance (availability, utilization, etc.), test for weaknesses, and conduct regular performance tuning. ·        Train users on proper use of the CIS. ·        Research and make recommendations on CIS policies and administration. Specifically, implement processes and systems to monitor data quality. ·        Collaborate with business units to produce and continuously improve Business Intelligence reports, increase data accessibility, and foster data-driven decision making across the organization. ·        Create and maintain Java ADHOC modules, when needed.   ORACLE DB Administration Oversee day-to-day operation of the database instance(s). Install and configure database software. Manage licenses for all database-related software. Manage the deployment of appropriate security patches, hot fixes, and software updates. Manage database user accounts, roles, and permissions. Manage database storage and plans for future capacity. Perform database backups according to a regular schedule. Recover data from backups as needed. Monitor performance and tune the database and queries for best performance. Participate in the development of policies, procedures, and resources that standardize the use and operation of database resources. Keep up-to-date documentation of database installations, physical and logical models. Collaborate with Software Engineers in developing the Insurtech applications.   Qualifications: ·        Graduate of any Business, IT or Engineering course. ·        Strong foundation on Accounting is a must. ·        Certifications preferred: o   Oracle DBA Associate o   Java SE or Java EE o   AWS Cloud Practitioner and/or AWS Certified Database – Specialty ·        At least 5 years experience in the Insurance industry, using GENIISYS/GENWEB. ·        Strong interest in Data Science and Machine Learning. ·        Working knowledge on Business Intelligence software (Tableau, Oracle BI, or Power BI) is required. ·        Working knowledge on network hardware like servers, storage, VPNs, routers, and switches is required.  ·        Familiarity with backup and recovery software, hardware, and methodologies. ·        Proven experience in SQL, PL/SQL, and Java. ·        Skills on Python will be a plus. ·        Working knowledge on Git. ·        Proficiency in working with both Windows and Linux Server OS. ·        Fast learner and fast worker. ·        Must possess the following skills: leadership; analyzing and critical thinking; time management; interpersonal skills; troubleshooting; communication; problem solving; planning; collaboration; research; writing of policies and procedures; attention to detail. ·        Excellent verbal and written communication skills. ·        Ability to work both independently and as part of a team. ·        Ability to evaluate critical systems, prioritize work, and determine solutions. ·        Ability to interpret and apply laws, regulations, and policies regarding data storage, retention, and auditing. ·        Able and willing to respond to helpdesk requests beyond office hours. ·        Has a minimum of 10 Mbps fiber connection at home."}, {"Website": "Workbank", "Job Title": "Network System And Security Administator", "Category": "Information and Communications Technology", "Company": "Fortune General Insurance Corporation", "Date Posted": "Posted 3 months ago", "Location": "Pasig", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The Network and Systems Administrator is responsible for maintaining a reliable, secure, and efficient network (both voice and data). S/he will procure, deploy, configure, maintain, secure, and monitor all network equipment in order to ensure smooth network operations, in support of the company’s Digital Transformation Strategy.   S/he must be highly capable, motivated, loves tackling problems head-on, and enjoys coming up with creative solutions.  S/he must be able to constantly be updated with hardware and software advancements.     Duties and Responsibilities:   1.      Network & Systems Administration   Design, procure, deploy, manage, and support the company’s network system, including the PBX sytem. Configure network hardware like servers, storage, routers, and switches.  Install and test technology-related equipment. Deploy and update operating systems and other software. Create and verify backups of data. ·        Set up user accounts, permissions and passwords. Troubleshoot network issues. ·        Resolve problems reported by end users. ·        Implement and ensure network security and connectivity. Maintain system security and telecommunication networks ·        Monitor network performance (availability, utilization, throughput, latency, etc.), test for weaknesses, and conduct regular performance tuning. ·        Research and make recommendations on server system administration. ·        Define network policies and procedures. Train users on proper use of software and hardware.     2.      IT Security   Analyze and establish security requirements for the network. Configure and support security tools such as firewalls, anti-virus software, patch management systems, etc. Create and implement network security policies, application security, access control and corporate data safeguards. Defend systems against unauthorized access, modification and/or destruction. Perform vulnerability and networking scanning assessments. Monitor network traffic for unusual activity. Develop and update business continuity and disaster recovery protocols Conduct security audits and make policy recommendations Train users in security awareness and procedures     Qualifications:   ·        Graduate of any IT or Engineering course. ·        Certifications preferred: o   Cisco Certified Network Associate (CCNA) o   Cisco Certified Network Professional (CCNP) o   Microsoft Certified Solutions Associate (MCSA) o   Microsoft Certified Solutions Expert (MCSE) o   CompTIA Network+ or Security+ o   AWS Cloud Practitioner and/or AWS Solutions Architect and/or AWS SysOps Administrator ·        Knowledge and experience in Insurance is preferred, but not required. ·        Ability to set up and configure server hardware. ·        Proven experience in a network and systems administration, as well as security management. ·        Familiarity with backup and recovery software and methodologies. ·        Proven experience in the following domains: Network Design and Implementation (including routing and switching) Windows Server Linux Microsoft Active Directory Wide Area Network (WAN) support Cisco networking products Domain Name System (DNS) Virtualization tools Hardware and software installation Technical support Network troubleshooting Virtual Private Network (VPN) ·        Advanced knowledge of system vulnerabilities and security issues. ·        Excellent knowledge of best practices around management, control, and monitoring of server infrastructure. ·        Experience with firewalls, VPN remote implementation, troubleshooting, and problem resolution. ·        Must possess the following skills: leadership; analyzing and critical thinking; time management; interpersonal skills; troubleshooting; communication; problem solving; planning; collaboration; research; writing of policies and procedures; attention to detail. ·        Excellent verbal and written communication skills. ·        Ability to work both independently and as part of a team. ·        Ability to evaluate critical systems, prioritize work, and determine solutions. ·        Able and willing to respond to help desk requests beyond office hours. Has a minimum of 10 Mbps fiber connection at home.  "}, {"Website": "Workbank", "Job Title": "Troubleshooting Support", "Category": "Information and Communications Technology", "Company": "SYKES Philippines", "Date Posted": "Posted 4 months ago", "Location": "Mandaluyong", "Status": "Full Time", "Salary": "", "Education": "College Undergraduate", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Work, learn and grow with the Top Employer and BPO Company of the Year!   WHY YOU SHOULD JOIN SYKES   SYKES is the best company where you can work, learn and grow. We offer competitive salary and benefits packages, provide various learning, development and mentoring opportunities and put programs in place to promote career growth. As a multinational digital marketing and customer service global outsourcer, we partner with Global 2000 companies. That means that you get to work with the world’s biggest brands and industry leaders! Here are some of the other benefits of working in SYKES:   ·         Competitive salary, account-specific benefits and performance incentives ·         Night differential and night shift allowances ·         Paid sick and vacation leaves ·         HMO coverage (medical and dental) for you, even during probationary period, and your qualified dependents ·         Life Insurance ·         Cool office spaces and employee-centric facilities ·         Accessible locations ·         Mentoring and development programs for career growth opportunities ·         Exclusive discounts in partner establishments ·         Company-sponsored interest clubs ·         Employee engagement activities ·         Volunteer programs ·         SYKES has been in the Philippines for more than 20 years and is considered the country’s first multinational contact center!   *The compensation package is inclusive of incentives and allowances. The basic salary varies depending on your assessment.   YOUR ROLE   Be part of one of the biggest technology companies in the world! We are looking for young and techie professionals to provide efficient technical support to our diverse clientele.   You might be the one we’re looking for!   ·         Bachelor’s degree holder or associate graduate ·         At least 6 months BPO experience is required ·         Basic knowledge of troubleshooting and technology concepts ·         Can communicate in English   Disclaimer: Some hiring requirements are filled immediately. To check if this job opening is still available, you may send our team a message through 09778259999 following this format – Workbank: <Inquiry>.   --   ATTESTATION   By submitting your application, you acknowledge that you have read and understood SYKES Recruitment and Privacy Policy (https://www.sykes.com/philippines/sykes-recruitment-and-privacy-policy/). You attest that the personal information you provided, such as, among others, those pertaining to your academic and professional qualifications are accurate, true, complete, and not misleading.   In addition, you give your consent to SYKES to verify the information you have provided relative to your application. This includes checks with your previous employers, academic and/or professional institutions and other agencies as permitted by law.   You further understand that SYKES is committed to ensuring the confidentiality of your personal data through the institution of appropriate legal, organizational, physical and technical measures to protect such data consistent with applicable privacy and data security laws. You confirm and consent to SYKES (i) collecting, processing and updating your personal data in connection with your employment application and the provision of services through the Sykes e-Recruitment (e-Rec) portal; (ii) publishing your personal data via SYKES e-Rec portal (iii) transferring of your personal data to Sykes affiliates, vendors and third parties in accordance with existing laws and regulations.   You are also aware that you are entitled to know whether SYKES holds your personal data, that you have the right to access your personal data, and that you may request for its supplementation, correction, or deletion, in accordance with local laws, as may be applicable. However, you acknowledge that certain personal data may be exempt from such access, correction and deletion requests pursuant to applicable data protection laws and regulations.   You confirm and consent to receiving alerts and notices from SYKES regarding important events, deadlines and schedules, HR announcements and other matters of interest related to your work application and possible employment with SYKES."}, {"Website": "Workbank", "Job Title": "Technical Support Representatives", "Category": "Information and Communications Technology", "Company": "SYKES Philippines", "Date Posted": "Posted 4 months ago", "Location": "Taguig", "Status": "Full Time", "Salary": "", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Get hired today and start working from home* ASAP!   *Disclaimer: Work-from-home setup is temporary. You will be required to report to our BGC site after the pandemic. Our recruitment team will discuss other employment details with you during your interview.   WHY YOU SHOULD JOIN SYKES   SYKES is the best company where you can work, learn and grow. We offer competitive salary and benefits packages, provide various learning, development and mentoring opportunities and put programs in place to promote career growth. As a multinational digital marketing and customer service global outsourcer, we partner with Global 2000 companies. That means that you get to work with the world’s biggest brands and industry leaders! Here are some of the other benefits of working in SYKES:   ·         Competitive salary, account-specific benefits and performance incentives ·         Night differential and night shift allowances ·         Paid sick and vacation leaves ·         HMO coverage (medical and dental) for you, even during probationary period, and your qualified dependents ·         Life Insurance ·         Cool office spaces and employee-centric facilities ·         Accessible locations ·         Mentoring and development programs for career growth opportunities ·         Exclusive discounts in partner establishments ·         Company-sponsored interest clubs ·         Employee engagement activities ·         Volunteer programs ·         SYKES has been in the Philippines for more than 20 years and is considered the country’s first multinational contact center!   *The compensation package is inclusive of incentives and allowances. The basic salary varies depending on your assessment.   You might be the one we’re looking for!   ·         At least high school graduate ·         At least 1 year call center experience is required ·         At least 6 months gaming background on gaming consoles and PC games requiring access to the internet is required ·         Basic knowledge of troubleshooting and technology concepts ·         Can communicate in English ·         At least 30mbps internet speed and workspace suitable for work-at-home   Disclaimer: Some hiring requirements are filled immediately. To check if this job opening is still available, you may send our team a message through 09778259999 following this format – Workbank: <Inquiry>.   --   ATTESTATION   By submitting your application, you acknowledge that you have read and understood SYKES Recruitment and Privacy Policy (https://www.sykes.com/philippines/sykes-recruitment-and-privacy-policy/). You attest that the personal information you provided, such as, among others, those pertaining to your academic and professional qualifications are accurate, true, complete, and not misleading.   In addition, you give your consent to SYKES to verify the information you have provided relative to your application. This includes checks with your previous employers, academic and/or professional institutions and other agencies as permitted by law.   You further understand that SYKES is committed to ensuring the confidentiality of your personal data through the institution of appropriate legal, organizational, physical and technical measures to protect such data consistent with applicable privacy and data security laws. You confirm and consent to SYKES (i) collecting, processing and updating your personal data in connection with your employment application and the provision of services through the Sykes e-Recruitment (e-Rec) portal; (ii) publishing your personal data via SYKES e-Rec portal (iii) transferring of your personal data to Sykes affiliates, vendors and third parties in accordance with existing laws and regulations.   You are also aware that you are entitled to know whether SYKES holds your personal data, that you have the right to access your personal data, and that you may request for its supplementation, correction, or deletion, in accordance with local laws, as may be applicable. However, you acknowledge that certain personal data may be exempt from such access, correction and deletion requests pursuant to applicable data protection laws and regulations.   You confirm and consent to receiving alerts and notices from SYKES regarding important events, deadlines and schedules, HR announcements and other matters of interest related to your work application and possible employment with SYKES.  "}, {"Website": "Workbank", "Job Title": "IOS Developer", "Category": "Information and Communications Technology", "Company": "OUTLIANT", "Date Posted": "Posted 5 months ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "High School", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "***In order to interview you will have to fill out this application:  http://hiring.outliant.com/ Take your career to the next level at Outliant ( https://outliant.com )! Here you have the opportunity to lead innovative projects on modern technology as an iOS Developer. Grow and learn from other world class engineers on our team! You can choose your own hours, get paid to learn new skills, and lead new projects from the ground up. We develop software for many top companies and startups around the world, as well build our own internal products. We offer salary, paid time off, 13th month bonus, and more. Communicate with our team in slack in a casual environment where you can make a huge impact! Job Requirements: * Expertise in Swift and Objective-C * 4+ years of native iOS development in XCode * Experience deploying apps to the apple app store * Experience managing multiple dependencies with CocoaPods In your application submission, please include: - Links to any apps on the app store you worked on - Description of what you worked on for at least one project - Links to any open source projects you worked on - Other programming experience you may have such as android, web, backend, database javascript, python, etc A candidate should have their own computer and stable internet connection to apply. We want a full-time employee that is only working for us and able to commit around 40 hours per week. You are in charge of your own hours. We are extremely kind people who focus on cooperation, autonomy, and mastery. We will train you to be the best you can be and are ALWAYS here to help should you get stuck. The goal is for you to develop into a self-sufficient individual who adds tremendous value to the team. The interview process will involve hopping in a skype call to discuss your skillset. We are excited to speak with you and help you take your career to new heights :) p.s. We have a highly experienced team that is here to teach and train you. We've got your back!"}, {"Website": "Workbank", "Job Title": "React Native Engineer", "Category": "Information and Communications Technology", "Company": "OUTLIANT", "Date Posted": "Posted 5 months ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "PHP 125,000 - 150,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 3 - 5 Years ", "Job Description": "Take your career to the next level at Outliant! (Mid level and Senior candidates welcome) *Feel free to apply as long as you have at least 1 year of React Native experience Here you have the opportunity to lead innovative projects on modern technology as a Senior React Native Engineer. Grow and learn from other world class engineers on our team! You can choose your own hours, get paid to learn new skills, and lead new projects from the ground up. We develop software for many top companies and startups around the world, as well build our own internal products. We offer salary, paid time off, 13th month (EOY) bonus, and more. Communicate with our team in slack in a casual environment where you can make a huge impact! We are in need of a full time developer with experience in the following: At least 1 year experience building a React Native project Understanding of functional programming and React Hooks Knowledge in testing using Jest, React Native Testing Library, React Test Renderer Javascript ES6 Typescript / Flow Redux / Redux Saga Can translate design to CSS and reusable components Keen on optimization, clean readable code and refactoring Git and Github Familiar with Jira and Agile Attention to detail Team player Experience using Sourcetree is a bonus (not required) A candidate should have their own Apple computer and stable internet connection to apply. We want a full-time employee that is only working for us and able to commit around 40 hours per week. You are in charge of your own hours. We are extremely kind people who focus on cooperation, autonomy, and mastery. We will train you to be the best you can be and are ALWAYS here to help should you get stuck. The goal is for you to develop into a self-sufficient individual who adds tremendous value to the team. The interview process will involve hopping in a skype call to discuss your skillset. We are excited to speak with you and help you take your career to new heights :) p.s. We have a highly experienced team that is here to teach and train you. We've got your back! ***In order to interview you will have to fill out this application: http://hiring.outliant.com/  "}, {"Website": "Workbank", "Job Title": "Technical Support", "Category": "Information and Communications Technology", "Company": "SYKES Philippines", "Date Posted": "Posted 6 months ago", "Location": "Mandaluyong", "Status": "Full Time", "Salary": "", "Education": "College Undergraduate", "Years of Work Expirience": " Less than 1 Year ", "Job Description": "Basic Technical Support Work, learn and grow with the Top Employer and BPO Company of the Year! WHY YOU SHOULD JOIN SYKES SYKES is the best company where you can work, learn and grow. We offer competitive salary and benefits packages, provide various learning, development and mentoring opportunities and put programs in place to promote career growth. As a multinational digital marketing and customer service global outsourcer, we partner with Global 2000 companies. That means that you get to work with the world’s biggest brands and industry leaders! Here are some of the other benefits of working in SYKES: Competitive salary, account-specific benefits and performance incentives Night differential and night shift allowances Paid sick and vacation leaves HMO coverage (medical and dental) for you, even during probationary period, and your qualified dependents Life Insurance Cool office spaces and employee-centric facilities Accessible locations Mentoring and development programs for career growth opportunities Exclusive discounts in partner establishments Company-sponsored interest clubs Employee engagement activities Volunteer programs SYKES has been in the Philippines for more than 20 years and is considered the country’s first multinational contact center! *The compensation package is inclusive of incentives and allowances. The basic salary varies depending on your assessment. YOUR ROLE Be part of one of the biggest technology companies in the world! We are looking for young and techie professionals to provide efficient technical support to our diverse clientele. You might be the one we’re looking for! Completed at least 2 years of college education No previous work experience needed but BPO experience is an advantage Basic knowledge of troubleshooting and technology concepts Can communicate in English Disclaimer: Some hiring requirements are filled immediately. To check if this job opening is still available, you may send our team a message through  09778259999  following this format – Workbank: <Inquiry>."}, {"Website": "Workbank", "Job Title": "ITIL Trainer", "Category": "Information and Communications Technology", "Company": "5G-IT Tutorial Center", "Date Posted": "Posted 9 months ago", "Location": "National Capital Region", "Status": "Part Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Carry out performance assessments to determine the skills gap between current and desirable learner skill levels. Coach other trainers in active learning principles to be used in all training activities Design course materials and documents such as handouts, manuals, and exercises. Explain specific tasks, techniques, and/or steps needed to perform activities; link practice to the “real life” duties of participants; provide corrective feedback."}, {"Website": "Workbank", "Job Title": "HEAVY EQUIPMENT OPERATOR (PAYLOADER)", "Category": "Construction", "Company": "Omnico Natural Resources, Inc.", "Date Posted": "Posted 1 week ago", "Location": "Badoc", "Status": "Full Time", "Salary": "PHP 10,400", "Education": "Technical/ Vocational Course", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsible for the safe and efficient operations of the payloader which is used to transport aggregate, sand and gravel, and back filling. Perform daily equipment and site inspections to identify and correct any unsafe conditions and keep equipment properly maintained (lubricating, fueling, and cleaning).    "}, {"Website": "Workbank", "Job Title": "Signage Technician", "Category": "Construction", "Company": "EMR CONSTRUCTION AND MANPOWER SERVICES INC", "Date Posted": "Posted 3 weeks ago", "Location": "Brunei Darussalam", "Status": "Contract", "Salary": "PHP 25,000 - 30,000", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " can paint, artistic, knowledgeable in drafting and hardworking"}, {"Website": "Workbank", "Job Title": "Domestic Helper", "Category": "Construction", "Company": "EMR CONSTRUCTION AND MANPOWER SERVICES INC", "Date Posted": "Posted 3 weeks ago", "Location": "Hong Kong", "Status": "Full Time", "Salary": "HKD 30,000 - 35,000", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "23 years old above with or without experience. High school or college graduate, female. "}, {"Website": "Workbank", "Job Title": "Project-in-charge", "Category": "Construction", "Company": "Verzontal Infrastructure Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Legazpi City", "Status": "Full Time", "Salary": "PHP 20,000 - 25,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The Project In-Charge is responsible for planning and managing projects from pre-construction phase to completion, ensuring that they are completed in accordance to schedule, budget, approved plans and specification of the owner and making sure that the project conforms to Government Laws, Regulation and Pertinent codes.  "}, {"Website": "Workbank", "Job Title": "Project-in-charge", "Category": "Construction", "Company": "Verzontal Infrastructure Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "National Capital Region", "Status": "Full Time", "Salary": "PHP 20,000 - 25,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The Project In-Charge is responsible for planning and managing projects from pre-construction phase to completion, ensuring that they are completed in accordance to schedule, budget, approved plans and specification of the owner and making sure that the project conforms to Government Laws, Regulation and Pertinent codes."}, {"Website": "Workbank", "Job Title": "Site Engineer", "Category": "Construction", "Company": "Verzontal Infrastructure Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "National Capital Region", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "  1.      Assist the Project Director in planning, preparation and submission of Verzontal Builders Inc. related reports. 2.      Assists the project team in preparing and evaluating bidding documents 3.      Assists in conducting site inspection to ensure proper execution of works. 4.      Responsible for the documentation of the Project records and files. 5.      Responsible in handling project-related incoming and outgoing communications (i.e. consultants, contractors, suppliers, etc.). 6.      Responsible for the update and general upkeep of Project records and files. 7.      Responsible for setting up meetings, schedules and other activities of the projects. Provide support/assistance to the Project Team when necessary"}, {"Website": "Workbank", "Job Title": "Site Engineer", "Category": "Construction", "Company": "Verzontal Infrastructure Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Legazpi City", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "1.      Assist the Project-in-Charge in planning, preparation and submission of Verzontal Builders Inc. related reports. 2.      Assists the project team in preparing and evaluating bidding documents 3.      Assists in conducting site inspection to ensure proper execution of works. 4.      Responsible for the documentation of the Project records and files. 5.      Responsible in handling project-related incoming and outgoing communications (i.e. consultants, contractors, suppliers, etc.). 6.      Responsible for the update and general upkeep of Project records and files. 7.      Responsible for setting up meetings, schedules and other activities of the projects. 8.      Provide support/assistance to the Project Team when necessary.    "}, {"Website": "Workbank", "Job Title": "Site Engineer", "Category": "Construction", "Company": "Verzontal Infrastructure Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "National Capital Region", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "  1.      Assist the Project-in-Charge in planning, preparation and submission of Verzontal Builders Inc. related reports. 2.      Assists the project team in preparing and evaluating bidding documents 3.      Assists in conducting site inspection to ensure proper execution of works. 4.      Responsible for the documentation of the Project records and files. 5.      Responsible in handling project-related incoming and outgoing communications (i.e. consultants, contractors, suppliers, etc.). 6.      Responsible for the update and general upkeep of Project records and files. 7.      Responsible for setting up meetings, schedules and other activities of the projects. 8.      Provide support/assistance to the Project Team when necessary."}, {"Website": "Workbank", "Job Title": "HR Generalist", "Category": "Construction", "Company": "Verzontal Infrastructure Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Pasig", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "·               Leads and conducts the orientation program/activity for new employees; ·               Oversees the work schedule/assignments and daily work flow of the subordinates/staffs in the department; ·               Updates employee’s records such as SIL, licenses and the like; ·               Monitors the employee’s day to day activities/field work through permission slip and travel order; ·               Assists the new employee in filing his/her statutory requirements such as SSS, TIN, PHIC, HDMF nos., NBI clearance, and NSO birth cert. ·               Assists in processing of the employee’s pay card; ·               Prepares and submits monthly reports of employee’s tardiness, leaves, and under time; ·               Extracts biometric of employees/workers  to be submitted to payroll officer; ·               Assists the HR Manager in preparing the annual training/activities for employees; ·               Prepares memoranda and all correspondence (internal and external) and facilitates its dissemination; and                 Prepares requisitions for office supplies and maintains record of office requisitions  "}, {"Website": "Workbank", "Job Title": "Welder Assembler (MIG/TIG)", "Category": "Construction", "Company": "Industrial Personnel and Management Services, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Canada", "Status": "Contract", "Salary": "", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Task Description: Read and interpret blueprints or welding process specifications Operate manual or semi-automatic welding equipment to fuse metal segments using processes such as gas tungsten arc welding (GTAW), gas metal arc welding (GMAW) and shielded metal arc welding (SMAW). Operate manual or semi-automatic flame-cutting equipment Operate brazing and soldering equipment Operate metal shaping machines such as brakes, shears and other metal straightening and bending machines Repair worn parts of metal products by welding on extra layers.  "}, {"Website": "Workbank", "Job Title": "Spotter (Heavy Equipment Operator)", "Category": "Construction", "Company": "Eco Cycen Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Goa", "Status": "Full Time", "Salary": "", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The holder of this position is responsible for assisting and guiding the Operator in operating the equipment in safe and efficient way. The work requires considerable skills in providing constant attention to safety precautions and measures before, during and after equipment’s operation/utilization."}, {"Website": "Workbank", "Job Title": "Backhoe Operator", "Category": "Construction", "Company": "Eco Cycen Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Goa", "Status": "Full Time", "Salary": "", "Education": "Technical/ Vocational Course", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The holder of this position is responsible for operating the equipment in safe and efficient way. This includes the following but not limited to loading, unloading, excavating, scooping and stock piling. The work requires considerable skill in manipulating the equipment and giving constant attention to safety operation in order to prevent accidents."}, {"Website": "Workbank", "Job Title": "Metal Fabricator / Fitter", "Category": "Construction", "Company": "Industrial Personnel and Management Services, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Canada", "Status": "Contract", "Salary": "", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " Task Description: Study engineering drawings and blueprints, determine the materials required, and plan the sequence of tasks to cut metal most efficiently. Construct patterns and templates as guides for layouts Operate manual or semi-automatic welding equipment to fuse metal segments using processes such as gas tungsten arc welding (GTAW), gas metal arc welding (GMAW), flux-cored arc welding (FCAW), plasma arc welding (PAW), shielded metal arc welding (SMAW), oxy-acetylene welding (OAW), resistance welding and submerged arc welding (SAW). Operate manual or semi-automatic flame-cutting equipment. Operate brazing and soldering equipment. Operate metal shaping machines such as brakes, shears and other metal straightening and bending machines. Lay out reference points and patterns on heavy metal according to component specifications. Rig, hoist and move materials to storage areas or within worksite. Assemble and fit metal sections and plates to form complete units or subunits using tack welding, bolting, riveting or other methods. Set up and operate various heavy-duty metal-working machines such as brake presses, shears, cutting torches, grinders and drills, including computer numerical control (CNC) equipment, to bend, cut, form, punch, drill or otherwise form heavy-metal components. Install fabricated components in final product."}, {"Website": "Workbank", "Job Title": "Carpenter", "Category": "Construction", "Company": "UNO OVERSEAS PLACEMENT INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Japan", "Status": "Full Time", "Salary": "", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Rough Carpentry Making iof Framework No Salary deduction No Processing Fee No Salary Deduction"}, {"Website": "Workbank", "Job Title": "Project Officer- Electrical Engineer", "Category": "Construction", "Company": "Cleamco Industrial Corporation", "Date Posted": "Posted 2 months ago", "Location": "Quezon City", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " Duties and Responsibilities: ·         Review contract documents, design drawings, technical specifications and other project details specifically but not limited to Electrical, Mechanical, and Plumbing / Sanitary ·         Review and evaluate contractor/s schedule and quality plan ·         Function as the client’s auditor / representative on site to ensure that the project execution of contractor/s are in compliance with the contract agreement ·         Conduct quality inspections and ensure that the contractor/s are in compliance with the agreed quality standards as per contract with client ·         Ensures all documentation related to the project quality control are complete and in order prior to acceptance of the project ·         Takes charge of all quality control documents of the project and ensures that these are properly stored and archived for future reference ·         Cost Management through proper review and evaluation of financial billings, change orders, and claims of contractor/s ·         Participates in meetings and helps in resolving engineering and management issues related to project timeline, cost management and quality control ·         Provide audit and progress reports to client ·         Practice recommended behaviors that adhere to the Core Values of the Company ·         Implement and comply with Company Rules and Policies ·         Perform other related duties that may be assigned by superiors Qualifications: ·         Age: 25 – 35 years old ·         Candidate must possess at least a Bachelor’s Degree in Electrical Engineering ·         At least 5 years of working experience in the related field is required for this position ·         Must have excellent oral and written communication skill"}, {"Website": "Workbank", "Job Title": "Project Officer-Civil Engineer", "Category": "Construction", "Company": "Cleamco Industrial Corporation", "Date Posted": "Posted 2 months ago", "Location": "Quezon City", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " Duties and Responsibilities: ·         Review contract documents, design drawings, technical specifications and other project details specifically but not limited to Electrical, Mechanical, and Plumbing / Sanitary ·         Review and evaluate contractor/s schedule and quality plan ·         Function as the client’s auditor / representative on site to ensure that the project execution of contractor/s are in compliance with the contract agreement ·         Conduct quality inspections and ensure that the contractor/s are in compliance with the agreed quality standards as per contract with client ·         Ensures all documentation related to the project quality control are complete and in order prior to acceptance of the project ·         Takes charge of all quality control documents of the project and ensures that these are properly stored and archived for future reference ·         Cost Management through proper review and evaluation of financial billings, change orders, and claims of contractor/s ·         Participates in meetings and helps in resolving engineering and management issues related to project timeline, cost management and quality control ·         Provide audit and progress reports to client ·         Practice recommended behaviors that adhere to the Core Values of the Company ·         Implement and comply with Company Rules and Policies ·         Perform other related duties that may be assigned by superiors Qualifications: ·         Age: 25 – 35 years old ·         Candidate must possess at least a Bachelor’s Degree in Civil Engineering ·         At least 5 years of working experience in the related field is required for this position ·         Must have excellent oral and written communication skill"}, {"Website": "Workbank", "Job Title": "TAILOR", "Category": "Design and Architecture", "Company": "HUMANIA INTERNATIONAL INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Al Daayen", "Status": "Full Time", "Salary": "PHP 30,000 - 35,000", "Education": "High School", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "to work in a fashion company of garment to draw and cut out sets of patterns for specified ranges of garments sizes as well as grading(increasing dimensions) a master pattern of each size within a set also observe operations to verify that pattern parts are marked for fabric weave lines, coded to specifications, reproduced clearly, and assembled in specified order.  "}, {"Website": "Workbank", "Job Title": "Polution Control Officer", "Category": "Environmental and Health Safety", "Company": "Toyota Calasiao", "Date Posted": "Posted 3 weeks ago", "Location": "Calasiao", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Environmental Compliance Officer / ISO PIC With PCO Training and /or Accreditation Willing to work in a collaborative environment Willing to work with a dynamic and challenging role A resident of nearly city or municipality"}, {"Website": "Workbank", "Job Title": "Occupational Safety And Health Nurse", "Category": "Environmental and Health Safety", "Company": "Omnico Natural Resources, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Badoc", "Status": "Full Time", "Salary": "PHP 10,000 - 15,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Provide basic healthcare services to employees. Responsible for developing and implementing Health and Safety Programs, assessing health risks in addition to the prevention and treatment of resultant illness or injury. Promote good health among employees by assessing them at regular intervals, and keeping health records for every employee. Maintaining good communication with company management regarding healthcare and safety.    "}, {"Website": "Workbank", "Job Title": "Safety And Environment Supervisor", "Category": "Environmental and Health Safety", "Company": "Gardenia Bakeries Philippines, Inc.", "Date Posted": "Posted 1 month ago", "Location": "Biñan City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Responsible in implementing Safety Programs in the workplaces with appropriate procedures. The purpose (is to eliminate unsafe practices, acts, conditions, materials and equipment losses in the workplaces. It combines knowledge of systems engineering and safety to make sur e that chemicals, machinery and consumer products will not cause harm to people or buildings. A graduate of bachelor engineering ( environment / health / safety/ mechanical /chemical) or equivalent with at least 1 year experience as Safety Officer / Engineer or related fields Preferably with BOSH Certification"}, {"Website": "Workbank", "Job Title": "Company Nurse", "Category": "Medical and Healthcare", "Company": "IOPEX Technologies Philippines", "Date Posted": "Posted 18 hours ago", "Location": "Taguig", "Status": "Full Time", "Salary": "PHP 20,000 - 25,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "iOPEX Technologies is currently hiring for Company Nurses to start ASAP! Fresh Graduates and no experience are welcome to apply! Job Responsibilities: Plan and recommends sufficient stocks of first aid medicine and reasonable acquisition of necessary medical equipment and kits as required by under Occupational Safety and Health Code under DOLE. Examines and treat employee's sickness and injuries; approve sick leaves and return to work from sick leave. Prepares and submits mandatory reportorial requirements and documents concerning occupational safety and health to government. Prepare summary reports of sickness. Deal with HMO provider in terms of enrolment/deletion/claims of members. Job Qualifications: Must possess at least a Bachelor's degree in Nursing and has an active PRC ID. Must have certifications in BLS/ACLS/BOSH and First Aid Training. Must be willing to work in the Mid shift or Night shift schedule. Must be willing to work at BGC, Taguig. Available to start ASAP.  "}, {"Website": "Workbank", "Job Title": "PHYSICIAN", "Category": "Medical and Healthcare", "Company": "LORMA", "Date Posted": "Posted 3 weeks ago", "Location": "San Fernando City, La Union", "Status": "Contract", "Salary": "", "Education": "Doctorate Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "1. Examines patients and diagnose ailments, treats diseases by prescribing medicine and other therapeutic means.  "}, {"Website": "Workbank", "Job Title": "PHARMACIST", "Category": "Medical and Healthcare", "Company": "LORMA", "Date Posted": "Posted 3 weeks ago", "Location": "San Fernando City, La Union", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "1. Record controlled drugs to registered opium books and additional opium books. 2. Compound prescriptions not commercially available. 3. Fills prescription and dispense drugs. 4. Check the manufacture and expiration dates, labels of drugs."}, {"Website": "Workbank", "Job Title": "DIALYSIS NURSE", "Category": "Medical and Healthcare", "Company": "LORMA", "Date Posted": "Posted 3 weeks ago", "Location": "San Fernando City, La Union", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "1. Perform regular hemodialysis treatment to both in and out patient. 2. Perform emergency hemodialysis on a 24 hour basis. 3. Conducts continuous research concerning hemodialysis. 4.  Provide updates to medical personnel, nurse and technicians through seminars and conventions. 5. Attend continuous training, seminar, workshop to enrich knowledge, growth and skill."}, {"Website": "Workbank", "Job Title": "STAFF NURSE", "Category": "Medical and Healthcare", "Company": "LORMA", "Date Posted": "Posted 3 weeks ago", "Location": "San Fernando City, La Union", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "1. Participates in planning, administering and supervising nursing care of the patients so that the total needs of the patients are met. 2. Uses judgment and skill in recognizing and meeting the needs of the patients and their families. 3. Participates in the orientation of a new personnel in the nursing service as far as routine procedures in the ward are concerned"}, {"Website": "Workbank", "Job Title": "NURSE", "Category": "Medical and Healthcare", "Company": "LARIOSA CLINIC AND HOSPITAL INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Surallah", "Status": "Full Time", "Salary": "PHP 18,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "  Duties and Responsibilities -Receives helps and plans for the appropriate care of the patient. Responsible for the carrying out of physician’s orders regarding the medical management including rehabilitation of the patient at the same time ensuring confidentiality of patients’ records. -Responsible for administering medications to patients after a careful and thorough verification and understanding of the physician’s orders. Follows up the general condition of the patient and gives vital feedbacks regarding patients’ reactions to medications given.   Qualifications: A registered nurse in the Philippines; Willing to work in Surallah"}, {"Website": "Workbank", "Job Title": "20 STAFF NURSES NEEDED", "Category": "Medical and Healthcare", "Company": "LARIOSA CLINIC AND HOSPITAL INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Banga, South Cotabato", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Duties and Responsibilities -Receives helps and plans for the appropriate care of the patient. Responsible for the carrying out of physician’s orders regarding the medical management including rehabilitation of the patient at the same time ensuring confidentiality of patients’ records. -Responsible for administering medications to patients after a careful and thorough verification and understanding of the physician’s orders. Follows up the general condition of the patient and gives vital feedbacks regarding patients’ reactions to medications given.   Qualifications: 1. A registered nurse in the Philippines; 2. A graduate of BS in Nursing 3. Extensive knowledge in general medical and surgical nursing specialties. 4. Good communication skills both oral and verbal 5. Possesses very good people skills 6. Reliable and responsible 7. With very good judgment and decision making skills 8. Physically and mentally sound. 9.  Willing to work in Surallah"}, {"Website": "Workbank", "Job Title": "NURSES", "Category": "Medical and Healthcare", "Company": "LARIOSA CLINIC AND HOSPITAL INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Surallah", "Status": "Full Time", "Salary": "PHP 18,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Duties and Responsibilities -Receives helps and plans for the appropriate care of the patient. Responsible for the carrying out of physician’s orders regarding the medical management including rehabilitation of the patient at the same time ensuring confidentiality of patients’ records. -Responsible for administering medications to patients after a careful and thorough verification and understanding of the physician’s orders. Follows up the general condition of the patient and gives vital feedbacks regarding patients’ reactions to medications given.   Qualifications: 1. A registered nurse in the Philippines; 3. Extensive knowledge in general medical and surgical nursing specialties. 4. Good communication skills both oral and verbal 5. Possesses very good people skills 6. Reliable and responsible 7. With very good judgment and decision making skills 8. Physically and mentally sound.  "}, {"Website": "Workbank", "Job Title": "Medical Specialist III (Part Time)", "Category": "Medical and Healthcare", "Company": "Mariano Marcos Memorial Hospital & Medical Center", "Date Posted": "Posted 3 weeks ago", "Location": "Batac City", "Status": "Full Time", "Salary": "PHP 43,371", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Conducts thorough examination of patients. Gives medical attention to patients admitted in corresponding specialty department where he/she is assigned; directs and participates in their treatment, management, and care. Prescribes treatment procedures and techniques within his/her field of specialization. Supervises and/or conducts research on various diseases and etiology, cure, and prevention as well as on progress of therapeutic management on confined patients. Follows up discharged cases to determine reappearance of symptoms and efficacy of treatment. Evaluates performance of Medical Officers and other direct subordinates. Coordinates public health programs as assigned. Ensures completeness of relevant medical documentation. Performs other related functions as may be assigned."}, {"Website": "Workbank", "Job Title": "Medical Specialist III", "Category": "Medical and Healthcare", "Company": "Mariano Marcos Memorial Hospital & Medical Center", "Date Posted": "Posted 3 weeks ago", "Location": "Batac City", "Status": "Full Time", "Salary": "PHP 86,742", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Conducts thorough examination of patients. Gives medical attention to patients admitted in corresponding specialty department where he/she is assigned; directs and participates in their treatment, management, and care. Prescribes treatment procedures and techniques within his/her field of specialization. Supervises and/or conducts research on various diseases and etiology, cure, and prevention as well as on progress of therapeutic management on confined patients. Follows up discharged cases to determine reappearance of symptoms and efficacy of treatment. Evaluates performance of Medical Officers and other direct subordinates. Coordinates public health programs as assigned. Ensures completeness of relevant medical documentation. Performs other related functions as may be assigned."}, {"Website": "Workbank", "Job Title": "Nursing Aide", "Category": "Medical and Healthcare", "Company": "FAASI INTERNATIONAL CORPORATION", "Date Posted": "Posted 3 weeks ago", "Location": "Singapore", "Status": "Contract", "Salary": "PHP 25,000 - 30,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "work as nursing asisstant work is cater to elderly / pediatric work on shifting schedule with a day off weekly  "}, {"Website": "Workbank", "Job Title": "Medical Social Worker", "Category": "Medical and Healthcare", "Company": "Allah Valley Medical Specialists Center, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "PHP 10,000 - 15,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Provides patient care by: Educating patients and families about illnesses and treatment plans. Conducting psychosocial assessments to identify mental or emotional distress. Counseling those in crisis or experiencing distress.  "}, {"Website": "Workbank", "Job Title": "Office Clerk", "Category": "Medical and Healthcare", "Company": "Allah Valley Medical Specialists Center, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Work from Home", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Oversees a variety of clerical and administrative duties in a company including preparing documents, scheduling meetings, and updating company records.  "}, {"Website": "Workbank", "Job Title": "Registered Nurse (RN)", "Category": "Medical and Healthcare", "Company": "Grand Placement & General Services Corporation", "Date Posted": "Posted 3 weeks ago", "Location": "Germany", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Monitor patient’s condition and assess their needs to provide the best possible care and advice Observe and interpret patient’s symptoms and communicate them to physicians Collaborate with physicians and nurses to devise individualized care plans for patients Perform routine procedures (blood pressure measurements, administering injections etc.) and fill in patients’ charts Adjust and administer patient’s medication and provide treatments according to physician’s orders Inspect the facilities and act to maintain excellent hygiene and safety (decontaminating equipment, sanitizing surfaces, preparing beds etc.) Provide instant medical care in emergencies"}, {"Website": "Workbank", "Job Title": "NURSES", "Category": "Medical and Healthcare", "Company": "HUMANIA INTERNATIONAL INC.", "Date Posted": "Posted 3 weeks ago", "Location": "Kuwait", "Status": "Full Time", "Salary": "PHP 40,000 - 45,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Have experienced in a Hospital or Dental Clinic. Candidate must be graduate of Bachelor of Science in Nursing, Licensed Nurse with valid I.D license issued by the PRC,Manila. Possess good characteristics , speak English very well. "}, {"Website": "Workbank", "Job Title": "Pharmacist", "Category": "Medical and Healthcare", "Company": "Allah Valley Medical Specialists Center, Inc.", "Date Posted": "Posted 3 weeks ago", "Location": "Koronadal City", "Status": "Full Time", "Salary": "PHP 10,000 - 15,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Prepares medications by reviewing and interpreting physician orders and detecting therapeutic incompatibilities. Dispenses medications by compounding, packaging, and labeling pharmaceuticals. Controls medications by monitoring drug therapies; advising interventions.  "}, {"Website": "Workbank", "Job Title": "Staff Nurse", "Category": "Medical and Healthcare", "Company": "Allah Valley Medical Specialists Center, Inc.", "Date Posted": "Posted 4 weeks ago", "Location": "Koronadal City", "Status": "Full Time", "Salary": "PHP 20,000 - 25,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "We are looking for a Registered Nurse to join our nursing staff in providing excellent health care to our patients. Your duty of caring for the patients coming into our facility includes tasks like creating and maintaining accurate patient records, administering medication and monitoring for side effects, recording vital signs, and reporting symptoms and changes in patient conditions. "}, {"Website": "Workbank", "Job Title": "Company Nurse", "Category": "Medical and Healthcare", "Company": "L3 Global Ventures Inc.", "Date Posted": "Posted 1 month ago", "Location": "San Juan City", "Status": "Full Time", "Salary": "PHP 25,000 - 30,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": " The Company Nurse is responsible for providing basic healthcare services through first aid treatment, administering appropriate medication, and assessment of employees' overall health within the company. The nurse shall promote occupational standards and evaluate health risks posed by or experienced while in the organization. He/She is also responsible for developing and implementing the Occupational Safety & Health (OSH) Program for staff and employees in coordination with other concerned parties and units involved in promoting health and safety in the entire organization. A Registered Nurse with at least 2 years of work experience combination of hospital and company setting and knowledge in Basic Occupational Safety and Health, or with BOSH Training Certificate. Join our Team today and Experience being taken care of while taking care of others. QUALIFICATIONS At least 1 year(s) of working experience in the related field is required for this position.  Preferably with experience in a corporate setting Experience in a hospital setting is an advantage but not required. Excellent English speaking and written communications Basic skills in Microsoft Word and Excel Must be amenable to work in San Juan, Manila Must be willing to work in a night shift schedule COMPENSATION Night Differential Weekends Off Fixed Night Shift Schedule and No Shifting Company incentives Complete benefits with daily lunch meals Mentoring and leadership programs Company outing and activities"}, {"Website": "Workbank", "Job Title": "Company Nurse", "Category": "Medical and Healthcare", "Company": "IOPEX Technologies Philippines", "Date Posted": "Posted 2 months ago", "Location": "Taguig", "Status": "Full Time", "Salary": "PHP 15,000 - 20,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Company Nurse Plan and recommends sufficient stocks of first aid medicine and reasonable acquisition of necessary medical equipment and kits as required by under Occupational Safety and Health Code under DOLE Examines and treat employees sickness and injuries; approve sick leaves and return to work from sick leave Prepares and submits mandatory reportorial requirements and documents concerning occupational safety and health to government Prepares summary reports of sickness Deal with the HMO provider in terms of enrollment/deletion/claims of members Qualifications Must possess at least a Bachelor's Degree in Nursing and has an active PRC ID Certifications in BOSH and First Aid Training is a Plus Experience with HMO and Benefits are a Plus Must be willing to work on a shifting schedule at Bonifacio Global City, Taguig What's in it for you? Our people enjoy some amazing perks, check out a few below: Competitive salary package Incentives Exciting employee engagement activities Learning sessions every week Fast career growth Free shuttle service Accessible location HMO OT/Holiday pay Leave credits Leave conversions Night differential Uncapped annual appraisal Seminars with certificates 2 days off And most importantly, you’ll be part of a growing company with dynamic and engaging team. Interested? Here are ways to reach us: Send a message to  09214815596 (YANA) Send your CV to  alyana.sia @ iopex.com"}, {"Website": "Workbank", "Job Title": "PH Registered Nurse (PHRN)", "Category": "Medical and Healthcare", "Company": "Hinduja Global Solutions", "Date Posted": "Posted 3 months ago", "Location": "Quezon City", "Status": "Full Time", "Salary": "PHP 25,000 - 30,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "MINIMUM QUALIFICATIONS: BS NURSING Graduate Must have an ACTIVE PRC LICENSE With at least 1-year hospital experience Excellent English communication skills Good interpersonal skills Analytical and problem-solving skills Good comprehension skills Basic knowledge of MS Office Amenable to work in Libis, Quezon City"}, {"Website": "Workbank", "Job Title": "US Registered Nurse (USRN)", "Category": "Medical and Healthcare", "Company": "Hinduja Global Solutions", "Date Posted": "Posted 3 months ago", "Location": "Quezon City", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "US Registered Nurse (USRN) with 100k Retention Bonus Qualification   -          College Graduate – BS Nursing -          With Active PRC and US Mainland License -          2 years of health-related jobs or Combined 1 year BPO Experience and 1-year health-related jobs. -          With 10mbps internet connection for both download and upload (Wired and Postpaid) -          Secured and quiet workspace"}, {"Website": "Workbank", "Job Title": "Company Nurse", "Category": "Medical and Healthcare", "Company": "Gardenia Bakeries Philippines, Inc.", "Date Posted": "Posted 3 months ago", "Location": "Biñan City", "Status": "Contract", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Administer first aid treatments and provide medications for employees as needed Monitor and record the patient's condition Assist all injured employees to the nearest hospital Maintain all employees medical and other similar records Secure and ensure that the sick employees submit a \"fit to work\" certificate Interpret and evaluate diagnostic test based on the verification of medical certificates Assist applicants in Physical Exam Schedule and assist annual medical examination of all employees Generate medical reimbursement report every month Conduct inventory of medicines and other supplies twice a month Assist Doctors Perform other duties and responsibilities that may be assigned from time to time  "}, {"Website": "Workbank", "Job Title": "US Registered Nurse Analyst", "Category": "Medical and Healthcare", "Company": "Accenture, Inc.", "Date Posted": "Posted 3 months ago", "Location": "National Capital Region", "Status": "Full Time", "Salary": "PHP 35,000 - 40,000", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "Go through a faster and more convenient recruitment process today and be part of one of the biggest and most stable organizations in the world! Apply now and receive Php150,000* Signing Bonus plus Php10,000* Monthly Premium Bonus!   Overall Purpose:   The  US Registered Nurse Analyst  is responsible to collaborate with healthcare providers and members to promote quality member outcomes, to optimize member benefits, and to promote effective use of resources. Ensures medically appropriate, high quality, cost effective care through assessing the medical necessity of inpatient admissions, outpatient services, focused surgical and diagnostic procedures, out of network services, and appropriateness of treatment setting by utilizing the applicable medical policy and industry standards, accurately interpreting benefits and managed care products, and may steer members to appropriate providers, programs or community resources.   Duties and Responsibilities:   Conduct UM pre-service, concurrent, retrospective, out of network, and appropriateness of treatment setting. Reviews service requests to ensure compliance with applicable criteria, medical policy, and member eligibility, benefits and contracts. Utilize client specific criteria sets (e.g., Milliman or InterQual), applicable client specific medical policy and client clinical guidelines for decision making to either approve or summarize and route to Client's nursing reviewer and/or Client's medical staff for review Accurately routes cases to client medical staff for further review when a service or admission does not meet medical necessity, place of service, or benefit criteria. Responsible for conducting medical management review activities which require the review of clinical information against client specific criteria as noted above, but excludes denial determinations. Process incoming requests, collection of information needed for review from providers, utilizing scripts to screen basic and complex requests for pre-certification and/or prior authorization. Verify benefits and/or eligibility information. Check benefits for facility-based treatment. Review of information and summarization of member's potential care needs and/or durable medical equipment (DME) needs following discharge and forward to client for final discharge plan. Conduct PSCCR claims review utilizing the member's benefit contract and health plan guidelines. Consult with clinical reviewers and/or U.S. - licensed medical directors to approve medically appropriate, high quality, cost effective care throughout the PSCCR process. Facilitate accreditation by knowing, understanding, correctly interpreting, and accurately applying accrediting and regulatory requirements and standards. Determine contract and benefit eligibility; obtain intake (demographic) information from callers and/or faxes. Conduct a thorough radius search in \"Provider Finder\" and follow up with provider on referrals given; refers cases requiring clinical review to a nurse reviewer. Responsible for reporting known or suspected data breaches on the day of discovery to a Team Lead or Manager.   Qualifications:   Graduate of Bachelor of Science in Nursing (BSN) Must have at least 3 months’ work experience as a Registered Nurse in a clinical setting Must have an active USRN License Holds current and unrestricted US Registered Nurse license (state-specific RN licensure)   Why join Accenture?   Competitive salary package, company bonuses, and performance incentives Night differential Loyalty, Christmas gift, Inclusion and diversity benefits Paid sick and vacation leaves Expanded maternity leave up to 120 days* HMO coverage (medical and dental) from day 1 of employment Life insurance Employee stock purchase plan Retirement plan Flexible working arrangements Accessible locations Healthy and encouraging work environment Career growth and promotion opportunities   *Terms and conditions apply    "}, {"Website": "Workbank", "Job Title": "Regional Regulatory Affairs Manager", "Category": "Medical and Healthcare", "Company": "Merck Business Solutions Asia Inc.", "Date Posted": "Posted 9 months ago", "Location": "Taguig", "Status": "Full Time", "Salary": "", "Education": "Bachelor’s Degree", "Years of Work Expirience": " 1 - 3 Years ", "Job Description": "The  Regulatory Affairs Manager  will be directly hired by Merck Inc. Your role:  As Regional Regulatory Affairs Manager for APAC, you oversee and coordinate day-to-day operations for the country cluster.  You lead, build and manage a professional team in the Regulatory Affairs Regional Hub for the products & countries under your responsibility.  You coach & direct the team to produce excellent work, and provide development opportunities for team to reach their full potential.  You develop regulatory product plans based on global/regional/local business strategy. You ensure plan alignment cross-functionally.  You provide regulatory support and insights for country/commercial strategies and initiatives.  You plan, manage, review & finalize submission with follow-up until final approval.  You provide support for specific local M1 requirements & manage country input and fee planning.  You communicate with partners & key local stakeholder functions including agents.  You plan, prepare & conduct local Health Authority interactions.  You maintain close communication & alignment with Health Authorities & other agencies, as applicable.  You represent Merck & prepare a communication to industry associations, as applicable.  You drive regional intelligence.  You cross-functionally coordinate crisis management such as stock-outs and maintain Health Authority interactions.  You provide relevant support for clinical trials, as applicable.  The position will be based in Bonifacio Global City, Taguig, Philippines. Who you are: Graduate of a Bachelor’s or Master’s Degree in pharmaceutical science or an equivalent qualification with relevant work experiences 5-8 years of experience in the regulatory affairs for ethical pharmaceutical products for the Philippines and preferably other Asian countries At least first-line manager experience is required The ability of communication and collaboration with internal and external stakeholders High proficiency in English is a must, additional Asian language capabilities welcome (e.g. Malay, Mandarin, Thai) Be flexible to travel on an occasional basis"}]